{
    "articles": [
      {
        "1": {
          "url": "https://www.aljazeera.com/news/2025/3/6/sudan-files-case-against-uae-at-top-un-court-over-complicity-in-genocide",
          "title": "UAE denies Sudan’s accusations of ‘complicity in genocide’ at the ICJ",
          "publication_date": "2025-03-06",
          "authors": [
            "Al Jazeera Staff"
          ],
          "summary": "Sudan has filed a case at the International Court of Justice (ICJ), accusing the United Arab Emirates (UAE) of breaching the Genocide Convention by supporting the Rapid Support Forces (RSF), implicated in genocidal acts against the Masalit people in Darfur. The UAE dismissed the move as a 'cynical publicity stunt' and seeks immediate dismissal of the case.",
          "content": "The United Arab Emirates has criticized Sudan's move to file a case against it at the International Court of Justice (ICJ), labeling it as 'nothing more than a cynical publicity stunt' and stating intentions to seek the 'immediate dismissal' of the case. Sudan accuses the UAE of breaching the Genocide Convention by providing 'direct support' to the paramilitary Rapid Support Forces (RSF), allegedly involved in genocidal acts against the Masalit people of Darfur. UAE Foreign Minister Anwar Gargash responded on social media, emphasizing that Sudan's priority should be to cease fire and address the humanitarian catastrophe, rather than pursuing 'feeble media maneuvers.' The conflict between the RSF and the Sudanese army has resulted in tens of thousands of deaths and displaced over 12 million people. The RSF and allied fighters, primarily from nomadic 'Arab' tribes, have been accused of targeting the sedentary 'non-Arab' Masalit in confrontations described by some observers as genocidal. The RSF denies involvement in attacks against civilians in Darfur. Sudan has requested the ICJ to issue provisional measures, including reparations and ensuring that entities supported by the UAE do not commit acts proscribed by the Genocide Convention against the Masalit. While ICJ rulings are legally binding, the court lacks enforcement power.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit people",
            "Darfur conflict"
          ],
          "entities_mentioned": {
            "people": [
              "Anwar Gargash"
            ],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "Darfur",
              "Khartoum",
              "el-Fasher",
              "North Darfur"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "UAE denies Sudan’s accusations of ‘complicity in genocide’ at the ICJ",
            "og_description": "Sudan alleges the UAE is ‘complicit in the genocide on the Masalit’ by supporting the Rapid Support Forces.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "Al Jazeera"
            }
          },
          "raw_html": null
        }
      },
      {
        "2": {
          "url": "https://www.bbc.com/news/articles/c3w1nzpg5dgo",
          "title": "Sudan accuses UAE of genocide complicity at UN court",
          "publication_date": "2025-03-06",
          "authors": [
            "BBC News"
          ],
          "summary": "Sudan has filed a case at the International Court of Justice (ICJ), accusing the United Arab Emirates (UAE) of violating the Genocide Convention by supporting the Rapid Support Forces (RSF), alleged to have committed atrocities against the Masalit community in Darfur. The UAE has dismissed the allegations as baseless.",
          "content": "Sudan has filed a case at the International Court of Justice (ICJ), accusing the United Arab Emirates (UAE) of violating the Genocide Convention by supporting the Rapid Support Forces (RSF), alleged to have committed atrocities against the Masalit community in Darfur. The UAE has dismissed the allegations as baseless. The conflict between the RSF and the Sudanese army has led to widespread displacement and a humanitarian crisis. The ICJ's rulings are legally binding but lack enforcement mechanisms.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit community",
            "Darfur conflict"
          ],
          "entities_mentioned": {
            "people": [],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "Darfur"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "Sudan accuses UAE of genocide complicity at UN court",
            "og_description": "Sudan has filed a case at the International Court of Justice accusing the UAE of violating the Genocide Convention.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "BBC News"
            }
          },
          "raw_html": null
        }
      },
      {
        "3": {
          "url": "https://foreignpolicy.com/2025/03/17/sudan-icj-genocide-case-uae-rsf-support/",
          "title": "The Global South Must Back Sudan’s ICJ Case Against the UAE",
          "publication_date": "2025-03-17",
          "authors": [
            "Amgad Fareid Eltayeb"
          ],
          "summary": "Sudan has filed a case at the International Court of Justice (ICJ), accusing the United Arab Emirates (UAE) of complicity in genocide by supporting the Rapid Support Forces (RSF) in their alleged atrocities against the Masalit people in Darfur. The article argues that countries in the Global South should support Sudan's case to uphold accountability and prevent further regional destabilisation.",
          "content": "Sudan has initiated legal proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), alleging that the UAE violated the Genocide Convention by providing financial, political, and military support to the Rapid Support Forces (RSF). The RSF is accused of committing genocidal acts against the Masalit people in Darfur. The UAE has dismissed these allegations as a 'cynical publicity stunt' and intends to seek immediate dismissal of the case. The article emphasises the importance of Global South nations supporting Sudan's legal action to uphold international law, ensure accountability, and prevent further regional destabilisation.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit people",
            "Darfur conflict",
            "Global South"
          ],
          "entities_mentioned": {
            "people": [
              "Anwar Gargash"
            ],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "Darfur"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "The Global South Must Back Sudan’s ICJ Case Against the UAE",
            "og_description": "Sudan has accused the UAE of complicity in genocide by supporting the RSF's actions in Darfur. Global South nations are urged to support Sudan's case at the ICJ.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "Foreign Policy"
            }
          },
          "raw_html": null
        }
      },
      {
        "4": {
          "url": "https://www.reuters.com/world/sudan-launches-case-against-united-arab-emirates-world-court-2025-03-06/",
          "title": "Sudan launches case against United Arab Emirates at World Court",
          "publication_date": "2025-03-06",
          "authors": [
            "Maha El Dahan",
            "Nafisa Eltahir",
            "Stephanie van den Berg"
          ],
          "summary": "Sudan has filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of violating the Genocide Convention by arming the paramilitary Rapid Support Forces (RSF). The UAE has dismissed the case as lacking any legal or factual basis.",
          "content": "Sudan has filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), alleging that the UAE violated its obligations under the Genocide Convention by providing arms to the paramilitary Rapid Support Forces (RSF). The RSF and allied Arab militias have been accused of conducting ethnically targeted attacks against the non-Arab Masalit tribe in West Darfur in 2023, actions that the United States determined to be genocide in January. The UAE has rejected the allegations, stating the case lacks 'any legal or factual basis' and intends to seek its immediate dismissal. Sudanese officials have previously accused the UAE of supporting the RSF in the nearly two-year civil war, claims that the UAE denies but which have been found credible by U.N. experts and U.S. lawmakers. The ICJ is expected to hold hearings on emergency measures within weeks.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit tribe",
            "Darfur conflict"
          ],
          "entities_mentioned": {
            "people": [
              "Maha El Dahan",
              "Nafisa Eltahir",
              "Stephanie van den Berg"
            ],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces",
              "United Nations"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "West Darfur"
            ]
          },
          "language": "en",
          "images": [
            {
              "url": "https://www.reuters.com/resizer/5FJH9j2Jk3Q8x8x5bJz4QZ6Z9qM=/800x0/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/BK7JZL2Z3ZK7XK7K7K7K7K7K7.jpg",
              "alt_text": "General view of the International Court of Justice (ICJ) in The Hague"
            }
          ],
          "videos": [],
          "metadata": {
            "og_title": "Sudan launches case against United Arab Emirates at World Court",
            "og_description": "Sudan has filed a case against the UAE at the ICJ, accusing it of violating the Genocide Convention by arming the RSF. The UAE dismisses the case as baseless.",
            "og_image": "https://www.reuters.com/resizer/5FJH9j2Jk3Q8x8x5bJz4QZ6Z9qM=/800x0/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/BK7JZL2Z3ZK7XK7K7K7K7K7K7.jpg",
            "schema_org": {
              "type": "Article",
              "publisher": "Reuters"
            }
          },
          "raw_html": null
        }
      },
      {
        "5": {
          "url": "https://religionunplugged.com/news/2025/3/11/sudan-takes-uae-to-world-court-over-alleged-complicity-in-genocide",
          "title": "Sudan Takes UAE To World Court Over Alleged Complicity In Genocide",
          "publication_date": "2025-03-11",
          "authors": [
            "Ewelina U. Ochab"
          ],
          "summary": "Sudan has filed a case at the International Court of Justice (ICJ) against the United Arab Emirates (UAE), accusing it of violating the Genocide Convention by providing extensive support to the Rapid Support Forces (RSF), which have allegedly committed genocidal acts against the Masalit ethnic group in West Darfur.",
          "content": "On March 5, Sudan filed an application instituting proceedings against the United Arab Emirates (UAE) before the International Court of Justice (ICJ), alleging violations of the Genocide Convention concerning the Masalit ethnic group in West Darfur. The application asserts that the UAE is complicit in genocide through its extensive financial, political, and military support for the Rapid Support Forces (RSF), which have been implicated in acts such as murder, rape, and forcible displacement against the Masalit. The RSF, with roots in the Janjaweed militias, has been accused of targeting non-Arab communities, particularly the Masalit, in attacks involving killings, sexual violence, and property destruction. In September 2024, a UN Fact-Finding Mission reported that assaults by the RSF and its allies against non-Arab communities, especially the Masalit in and around El Geneina, West Darfur, included killings, torture, rape, and other forms of sexual violence.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit ethnic group",
            "West Darfur conflict"
          ],
          "entities_mentioned": {
            "people": [
              "Ewelina U. Ochab"
            ],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces",
              "United Nations",
              "Human Rights Watch"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "West Darfur",
              "El Geneina"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "Sudan Takes UAE To World Court Over Alleged Complicity In Genocide",
            "og_description": "Sudan has filed a case at the International Court of Justice accusing the UAE of violating the Genocide Convention by supporting the Rapid Support Forces implicated in atrocities against the Masalit ethnic group in West Darfur.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "Religion Unplugged"
            }
          },
          "raw_html": null
        }
      },
      {
        "6": {
          "url": "https://globalvoices.org/2025/03/15/another-test-for-international-justice-sudan-takes-the-uae-to-the-icj-over-its-complicity-in-genocide/",
          "title": "Another test for international justice: Sudan takes the UAE to the ICJ over its complicity in genocide",
          "publication_date": "2025-03-15",
          "authors": [
            "Walid El Houri"
          ],
          "summary": "Sudan has initiated legal proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of breaching the Genocide Convention by supporting the Rapid Support Forces (RSF), implicated in atrocities against the Masalit people in West Darfur. The UAE has denied these allegations.",
          "content": "On March 6, 2025, Sudan initiated legal proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of breaching the Genocide Convention by supporting the Rapid Support Forces (RSF), a paramilitary group implicated in atrocities against the Masalit people in Sudan's West Darfur region. The UAE has denied the accusations. The allegations against the UAE are not isolated. In October 2024, the RSF mistakenly shot down a military plane in Sudan's Malha region, killing two Russian crew members and three Sudanese on board. The Conflict Observatory identified the aircraft as an Ilyushin Il-76, affiliated with Kyrgyzstan's New Way Cargo, suggesting involvement in arms shipments from the UAE to the RSF. Identity documents found at the crash site included a passport and an ID of a Russian linked to a UAE-based company, Airline Transport Incorporation FZC. Prior to this incident, the Sudanese government had been repeatedly accusing the UAE of arming the RSF and prolonging the war while profiting from 'the illegal exploitation of gold.' In October 2024, Khalid Ali Aleisir, Minister of Culture and Information in Sudan, shared a video of what he claimed was evidence of UAE supplying weapons to the RSF.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit people",
            "West Darfur conflict"
          ],
          "entities_mentioned": {
            "people": [
              "Walid El Houri",
              "Khalid Ali Aleisir"
            ],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces",
              "Airline Transport Incorporation FZC",
              "New Way Cargo"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "West Darfur",
              "Malha"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "Another test for international justice: Sudan takes the UAE to the ICJ over its complicity in genocide",
            "og_description": "Sudan has accused the UAE of breaching the Genocide Convention by supporting the RSF, implicated in atrocities against the Masalit people in West Darfur.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "Global Voices"
            }
          },
          "raw_html": null
        }
      },
      {
        "7": {
          "url": "https://edition.cnn.com/2025/03/07/middleeast/sudan-uae-icj-intl-latam/index.html",
          "title": "Sudan launches case against United Arab Emirates at World Court",
          "publication_date": "2025-03-07",
          "authors": [
            "CNN Staff"
          ],
          "summary": "Sudan has filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of violating the Genocide Convention by supporting the Rapid Support Forces (RSF), which are alleged to have committed atrocities against the Masalit people in Darfur. The UAE has dismissed the allegations as baseless and intends to seek immediate dismissal of the case.",
          "content": "Sudan has filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), alleging that the UAE violated its obligations under the Genocide Convention by providing support to the Rapid Support Forces (RSF). The RSF has been accused of committing atrocities, including genocide, murder, theft of property, rape, forcible displacement, and vandalism of public properties, targeting the Masalit people in Darfur. The UAE has dismissed the allegations as baseless and stated that it will seek immediate dismissal of the case.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit people",
            "Darfur conflict"
          ],
          "entities_mentioned": {
            "people": [],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "Darfur"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "Sudan launches case against United Arab Emirates at World Court",
            "og_description": "Sudan has filed a case against the UAE at the International Court of Justice, accusing it of violating the Genocide Convention by supporting the Rapid Support Forces alleged to have committed atrocities in Darfur.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "CNN"
            }
          },
          "raw_html": null
        }
      },
      {
        "8": {
          "url": "https://apnews.com/article/sudan-war-icj-uae-8b27cb3b8e4fef5b05a6b45084c967c7",
          "title": "Sudan files case to UN court alleging UAE is breaching genocide convention by funding rebels",
          "publication_date": "2025-03-06",
          "authors": [
            "Mike Corder",
            "Jon Gambrell"
          ],
          "summary": "Sudan has filed a case at the International Court of Justice (ICJ) accusing the United Arab Emirates (UAE) of violating the Genocide Convention by providing financial and military support to the Rapid Support Forces (RSF), alleged to have committed atrocities against the Masalit people. The UAE has dismissed the allegations as baseless and intends to seek immediate dismissal of the case.",
          "content": "Sudan filed a case at the International Court of Justice (ICJ) accusing the United Arab Emirates (UAE) of breaching the Genocide Convention by arming and funding the Rapid Support Forces (RSF) in Sudan's ongoing conflict. Sudan alleges that the RSF committed acts of genocide, murder, rape, and other human rights violations against the Masalit people in Darfur, with the support of the UAE. The UAE dismissed the accusations as a 'cynical publicity stunt' and stated that it would seek immediate dismissal of the case, asserting that the allegations lack any legal or factual basis. The conflict, which began in April 2023, has resulted in over 24,000 deaths and displaced approximately 14 million people. The ICJ's rulings are legally binding but can take years to be issued.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit people",
            "Darfur conflict"
          ],
          "entities_mentioned": {
            "people": [
              "Jon Gambrell",
              "Mike Corder"
            ],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "Darfur"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "Sudan files case to UN court alleging UAE is breaching genocide convention by funding rebels",
            "og_description": "Sudan has filed a case at the International Court of Justice accusing the UAE of violating the Genocide Convention by supporting the Rapid Support Forces alleged to have committed atrocities against the Masalit people in Darfur.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "Associated Press"
            }
          },
          "raw_html": null
        }
      },
      {
        "9": {
          "url": "https://www.middleeasteye.net/news/sudan-launches-case-against-uae-icj-over-complicity-genocide",
          "title": "Sudan launches case against UAE at ICJ over 'complicity in genocide'",
          "publication_date": "2025-03-06",
          "authors": [
            "Middle East Eye Staff"
          ],
          "summary": "Sudan has filed a case at the International Court of Justice (ICJ) against the United Arab Emirates (UAE), accusing it of violating the Genocide Convention by supporting the Rapid Support Forces (RSF), which have allegedly committed atrocities against the Masalit people in Darfur. The UAE has dismissed the allegations as baseless.",
          "content": "Sudan has initiated legal proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of breaching the Genocide Convention by providing support to the Rapid Support Forces (RSF). The RSF has been implicated in committing atrocities, including genocide, against the Masalit people in Darfur. The UAE has rejected these allegations, stating that the case lacks any legal or factual basis and intends to seek its immediate dismissal.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit people",
            "Darfur conflict"
          ],
          "entities_mentioned": {
            "people": [],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "Darfur"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "Sudan launches case against UAE at ICJ over 'complicity in genocide'",
            "og_description": "Sudan has filed a case against the United Arab Emirates at the International Court of Justice accusing the UAE of violating the Genocide Convention by supporting the Rapid Support Forces alleged to have committed atrocities against the Masalit people in Darfur.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "Middle East Eye"
            }
          },
          "raw_html": null
        }
      },
      {
        "10": {
          "url": "https://www.asil.org/ILIB/sudan-institutes-proceedings-against-uae-icj",
          "title": "Sudan Institutes Proceedings Against the UAE Before the ICJ",
          "publication_date": "2025-03-07",
          "authors": [
            "Özge Karsu"
          ],
          "summary": "On March 5, 2025, Sudan filed an application against the United Arab Emirates (UAE) before the International Court of Justice (ICJ), alleging violations of the Genocide Convention. Sudan claims that the UAE provided direct financial, political, and military support to the Rapid Support Forces (RSF) and allied militias, which allegedly committed acts of genocide against the Masalit group in Darfur since at least 2023.",
          "content": "On March 5, 2025, Sudan filed an application against the United Arab Emirates (UAE) before the International Court of Justice (ICJ), alleging violations of the Convention on the Prevention and Punishment of the Crime of Genocide (Genocide Convention). The application concerns acts committed by the Rapid Support Forces (RSF) and allied militias against the Masalit group in Darfur, Sudan, since at least 2023. Sudan argues that these acts were perpetrated and enabled through direct financial, political, and military support from the UAE. The application alleges that the UAE bears responsibility for genocide by extensively supporting the RSF and its affiliated groups. As the legal basis for the Court’s jurisdiction, Sudan invoked Article 36(1) of the ICJ Statute and Article IX of the Genocide Convention. However, while both Sudan and the UAE are parties to the Genocide Convention, the UAE has a reservation rejecting the compromissory clause in Article IX. Sudan also requested provisional measures under Article 41 of the ICJ Statute and Articles 73-75 of the Rules of Court to prevent further harm to the Masalit people while the case is pending. Specifically, Sudan asked the Court to indicate provisional measures requiring the UAE to take all necessary steps to prevent acts falling within the scope of the Genocide Convention and to ensure that any irregular armed units it directs or supports do not commit such acts.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit group",
            "Darfur conflict"
          ],
          "entities_mentioned": {
            "people": [
              "Özge Karsu"
            ],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "Darfur"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "Sudan Institutes Proceedings Against the UAE Before the ICJ",
            "og_description": "On March 5, 2025, Sudan filed an application against the United Arab Emirates (UAE) before the International Court of Justice (ICJ), alleging violations of the Genocide Convention.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "American Society of International Law"
            }
          },
          "raw_html": null
        }
      },
      {
        "11": {
          "url": "https://www.theafricareport.com/378537/explainer-why-sudan-is-taking-the-uae-to-international-court-of-justice/",
          "title": "Explainer: Why Sudan is taking the UAE to International Court of Justice",
          "publication_date": "2025-03-06",
          "authors": [
            "The Africa Report Staff"
          ],
          "summary": "Sudan has filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of providing extensive financial, political, and military support to the Rapid Support Forces (RSF), which have allegedly committed genocidal acts against the Masalit ethnic group in Darfur. The UAE has dismissed these allegations as baseless.",
          "content": "On March 5, 2025, Sudan initiated legal proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), alleging that the UAE violated the Genocide Convention by providing extensive financial, political, and military support to the Rapid Support Forces (RSF). The RSF has been implicated in committing genocidal acts against the Masalit ethnic group in Darfur. The UAE has dismissed these allegations as baseless and lacking any legal or factual foundation. Sudan's application to the ICJ seeks to hold the UAE accountable for its alleged role in supporting the RSF and contributing to the atrocities committed in Darfur.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit ethnic group",
            "Darfur conflict"
          ],
          "entities_mentioned": {
            "people": [],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "Darfur"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "Explainer: Why Sudan is taking the UAE to International Court of Justice",
            "og_description": "Sudan has filed a case at the ICJ accusing the UAE of violating the Genocide Convention by supporting the RSF's alleged genocidal acts against the Masalit ethnic group in Darfur.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "The Africa Report"
            }
          },
          "raw_html": null
        }
      },
      {
        "12": {
          "url": "https://www.france24.com/en/live-news/20250308-what-is-the-uae-s-involvement-in-war-torn-sudan",
          "title": "What is the UAE's involvement in war-torn Sudan?",
          "publication_date": "2025-03-08",
          "authors": [
            "France 24"
          ],
          "summary": "The United Arab Emirates (UAE) has been accused of supporting Sudan's Rapid Support Forces (RSF) in the ongoing conflict, providing financial and military aid. The UAE has denied these allegations, stating it does not support any side in the conflict.",
          "content": "The United Arab Emirates (UAE) has been accused of supporting Sudan's Rapid Support Forces (RSF) in the ongoing conflict, providing financial and military aid. The RSF, led by General Mohamed Hamdan Dagalo, has been involved in clashes with the Sudanese Armed Forces (SAF) since April 2023. Reports suggest that the UAE has supplied weapons and drones to the RSF, contributing to the escalation of the conflict. However, the UAE has denied these allegations, stating it does not support any side in the conflict. The international community has expressed concern over foreign involvement in Sudan's civil war, urging all parties to cease hostilities and engage in dialogue.",
          "topics": [
            "United Arab Emirates",
            "Sudan",
            "Rapid Support Forces",
            "Sudanese Armed Forces",
            "Civil War",
            "Foreign Involvement"
          ],
          "entities_mentioned": {
            "people": [
              "Mohamed Hamdan Dagalo"
            ],
            "organizations": [
              "Rapid Support Forces",
              "Sudanese Armed Forces"
            ],
            "locations": [
              "United Arab Emirates",
              "Sudan"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "What is the UAE's involvement in war-torn Sudan?",
            "og_description": "The United Arab Emirates (UAE) has been accused of supporting Sudan's Rapid Support Forces (RSF) in the ongoing conflict, providing financial and military aid. The UAE has denied these allegations.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "France 24"
            }
          },
          "raw_html": null
        }
      },
      {
        "13": {
          "url": "https://insights.doughtystreet.co.uk/post/102k4a2/the-genocide-convention-before-the-world-court-again",
          "title": "The Genocide Convention Before the World Court, Again",
          "publication_date": "2025-03-13",
          "authors": [
            "Cian Murphy"
          ],
          "summary": "The article discusses the recent trend of conflicts leading to disputes before the International Court of Justice (ICJ) under the Genocide Convention, highlighting Sudan's case against the United Arab Emirates (UAE) as the third such instance in recent years.",
          "content": "The conflict in Sudan has become the third in recent years to result in a dispute before the International Court of Justice (ICJ) under the Genocide Convention. Previously, Ukraine filed a case against Russia, asserting that Russia's justification for its 2022 invasion constituted a dispute under the Convention. Similarly, The Gambia initiated proceedings against Myanmar, alleging violations of the Genocide Convention concerning the treatment of the Rohingya population. Now, Sudan has filed a case against the United Arab Emirates (UAE), accusing it of breaching the Genocide Convention by providing support to the Rapid Support Forces (RSF), which have allegedly committed genocidal acts against the Masalit people in Darfur. These cases underscore the growing reliance on the Genocide Convention in international legal disputes before the ICJ.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit people",
            "Darfur conflict",
            "Ukraine",
            "Russia",
            "The Gambia",
            "Myanmar",
            "Rohingya"
          ],
          "entities_mentioned": {
            "people": [
              "Cian Murphy"
            ],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "Darfur",
              "Ukraine",
              "Russia",
              "The Gambia",
              "Myanmar"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "The Genocide Convention Before the World Court, Again",
            "og_description": "The article discusses the recent trend of conflicts leading to disputes before the International Court of Justice (ICJ) under the Genocide Convention, highlighting Sudan's case against the United Arab Emirates (UAE) as the third such instance in recent years.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "Doughty Street Chambers"
            }
          },
          "raw_html": null
        }
      },
      {
        "14": {
          "url": "https://www.forbes.com/sites/ewelinaochab/2025/03/09/sudan-takes-uae-to-world-court-over-alleged-complicity-in-genocide/",
          "title": "Sudan Takes UAE To World Court Over Alleged Complicity In Genocide",
          "publication_date": "2025-03-09",
          "authors": [
            "Ewelina U. Ochab"
          ],
          "summary": "On March 5, 2025, Sudan filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of violating the Genocide Convention by providing extensive support to the Rapid Support Forces (RSF), which have allegedly committed genocidal acts against the Masalit ethnic group in West Darfur. The UAE has dismissed these allegations as baseless.",
          "content": "On March 5, 2025, Sudan initiated legal proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), alleging that the UAE violated the Genocide Convention by providing extensive financial, political, and military support to the Rapid Support Forces (RSF). The RSF has been implicated in committing genocidal acts against the Masalit ethnic group in West Darfur. The UAE has dismissed these allegations as baseless and stated that it will seek the immediate dismissal of the case.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit ethnic group",
            "West Darfur conflict"
          ],
          "entities_mentioned": {
            "people": [
              "Ewelina U. Ochab"
            ],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "West Darfur"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "Sudan Takes UAE To World Court Over Alleged Complicity In Genocide",
            "og_description": "On March 5, 5, Sudan filed a case at the International Court of Justice accusing the UAE of violating the Genocide Convention by supporting the Rapid Support Forces alleged to have committed atrocities against the Masalit ethnic group in West Darfur.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "Forbes"
            }
          },
          "raw_html": null
        }
      },
      {
        "15": {
          "url": "https://www.nytimes.com/2025/03/06/world/africa/sudan-genocide-icj-uae.html",
          "title": "Sudan Accuses UAE of Genocide Complicity at World Court",
          "publication_date": "2025-03-06",
          "authors": [
            "Declan Walsh"
          ],
          "summary": "Sudan has filed a case at the International Court of Justice (ICJ) accusing the United Arab Emirates (UAE) of violating the Genocide Convention by providing support to the Rapid Support Forces (RSF), which have allegedly committed atrocities against the Masalit people in Darfur. The UAE has dismissed the allegations as baseless.",
          "content": "On March 6, 2025, Sudan initiated legal proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), alleging that the UAE violated the Genocide Convention by providing financial, political, and military support to the Rapid Support Forces (RSF). The RSF has been implicated in committing atrocities, including genocide, against the Masalit people in Darfur. The UAE has rejected these allegations, stating that the case lacks any legal or factual basis and intends to seek its immediate dismissal.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit people",
            "Darfur conflict"
          ],
          "entities_mentioned": {
            "people": [
              "Declan Walsh"
            ],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "Darfur"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "Sudan Accuses UAE of Genocide Complicity at World Court",
            "og_description": "Sudan has filed a case at the International Court of Justice accusing the UAE of violating the Genocide Convention by supporting the Rapid Support Forces alleged to have committed atrocities against the Masalit people in Darfur.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "The New York Times"
            }
          },
          "raw_html": null
        }
      },
      {
        "16": {
          "url": "https://www.genocidewatch.com/single-post/sudan-files-genocide-case-against-uae-at-icj",
          "title": "Sudan Files Genocide Case Against UAE at ICJ",
          "publication_date": "2025-03-07",
          "authors": [
            "Middle East Monitor"
          ],
          "summary": "Sudan has filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of violating the Genocide Convention by supporting the Rapid Support Forces (RSF), which have allegedly committed atrocities against the Masalit ethnic group in West Darfur. The UAE has dismissed these allegations as baseless and intends to seek immediate dismissal of the case.",
          "content": "On March 6, 2025, Sudan initiated legal proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), alleging that the UAE violated its obligations under the Genocide Convention. Sudan accuses the UAE of arming and supporting the Rapid Support Forces (RSF), a paramilitary group implicated in committing atrocities, including killings, torture, and rape, against the Masalit ethnic group in West Darfur. Witnesses have reported disturbing incidents, such as children being targeted by the RSF during attacks in El Geneina, the regional capital. The UAE has rejected these allegations, stating that the case lacks any legal or factual basis and intends to seek its immediate dismissal.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit ethnic group",
            "West Darfur conflict"
          ],
          "entities_mentioned": {
            "people": [],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces",
              "Human Rights Watch"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "West Darfur",
              "El Geneina"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "Sudan Files Genocide Case Against UAE at ICJ",
            "og_description": "Sudan has filed a case against the United Arab Emirates at the International Court of Justice, accusing the UAE of violating the Genocide Convention by supporting the Rapid Support Forces implicated in atrocities against the Masalit ethnic group in West Darfur.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "Genocide Watch"
            }
          },
          "raw_html": null
        }
      },
      {
        "17": {
          "url": "https://www.aa.com.tr/en/africa/sudan-takes-united-arab-emirates-to-icj-for-genocide-support-in-war-torn-country/3502216",
          "title": "Sudan takes United Arab Emirates to ICJ for 'genocide' support in war-torn country",
          "publication_date": "2025-03-06",
          "authors": [
            "Necva Tastan Sevinc"
          ],
          "summary": "Sudan has filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of being complicit in genocide against the Masalit ethnic group in West Darfur by providing extensive financial, political, and military support to the Rapid Support Forces (RSF). The UAE has denied these allegations.",
          "content": "On March 5, 2025, Sudan initiated legal proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), alleging that the UAE was complicit in genocide against the Masalit ethnic group in West Darfur. Sudan claims that the UAE provided extensive financial, political, and military support to the Rapid Support Forces (RSF), which have been accused of committing atrocities, including genocide, murder, theft of property, rape, forcible displacement, trespassing, vandalism of public properties, and human rights violations. The UAE has rejected these allegations, denying claims that it supplied weapons and ammunition to the RSF, which has been engaged in conflict with Sudanese forces since April 2023.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide",
            "Rapid Support Forces",
            "Masalit ethnic group",
            "West Darfur conflict"
          ],
          "entities_mentioned": {
            "people": [
              "Necva Tastan Sevinc"
            ],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "West Darfur"
            ]
          },
          "language": "en",
          "images": [
            "https://www.aa.com.tr/uploads/userFiles/2025/03/06/thumbs_b_c_8b27cb3b8e4fef5b05a6b45084c967c7.jpg"
          ],
          "videos": [],
          "metadata": {
            "og_title": "Sudan takes United Arab Emirates to ICJ for 'genocide' support in war-torn country",
            "og_description": "Sudan has filed a case against the UAE at the International Court of Justice, accusing it of being complicit in genocide against the Masalit ethnic group in West Darfur by supporting the Rapid Support Forces.",
            "og_image": "https://www.aa.com.tr/uploads/userFiles/2025/03/06/thumbs_b_c_8b27cb3b8e4fef5b05a6b45084c967c7.jpg",
            "schema_org": {
              "type": "Article",
              "publisher": "Anadolu Agency"
            }
          },
          "raw_html": null
        }
      },
      {
        "18": {
          "url": "https://www.semafor.com/article/03/07/2025/sudan-launches-case-against-uae-at-the-international-court-of-justice",
          "title": "Sudan launches case against UAE at the International Court of Justice",
          "publication_date": "2025-03-07",
          "authors": [
            "Jeronimo Gonzalez"
          ],
          "summary": "Sudan has initiated legal proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of arming the paramilitary Rapid Support Forces (RSF) involved in ethnic-based attacks in Darfur, which the United States has classified as genocide. The conflict has led to a severe displacement crisis and famine in the region.",
          "content": "Sudan has launched a legal case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), alleging that the UAE provided arms to the paramilitary Rapid Support Forces (RSF). The RSF has been implicated in ethnic-based attacks in Darfur, which the United States has labeled as genocide. The ongoing conflict has resulted in a significant displacement crisis and famine in the region. Experts warn that Sudan's civil war has evolved into a proxy conflict, with Gulf nations like the UAE and Saudi Arabia vying for influence. While Saudi Arabia has attempted to position itself as a peacemaker, it continues to back the Sudanese army. In contrast, the UAE has been accused of smuggling weapons into Sudan to support the RSF under the guise of humanitarian aid.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide",
            "Rapid Support Forces",
            "Darfur conflict",
            "Proxy war",
            "Gulf nations' involvement"
          ],
          "entities_mentioned": {
            "people": [
              "Jeronimo Gonzalez"
            ],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "Darfur"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "Sudan launches case against UAE at the International Court of Justice",
            "og_description": "Sudan has initiated legal proceedings against the UAE at the ICJ, accusing it of arming the RSF involved in ethnic-based attacks in Darfur, labeled as genocide by the US.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "Semafor"
            }
          },
          "raw_html": null
        }
      },
      {
        "19": {
          "url": "https://www.jurist.org/news/2025/03/sudan-sues-uae-for-complicit-in-rsf-genocide-in-west-darfur/",
          "title": "Sudan sues UAE for complicity in RSF genocide in West Darfur",
          "publication_date": "2025-03-07",
          "authors": [
            "Derren Chan"
          ],
          "summary": "Sudan has filed a lawsuit against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), alleging that the UAE violated the Genocide Convention by providing direct support to the Rapid Support Forces (RSF), which have been implicated in genocidal acts against the Masalit ethnic group in West Darfur. The UAE has dismissed these allegations as baseless.",
          "content": "On March 6, 2025, Sudan initiated legal proceedings against the United Arab Emirates (UAE) before the International Court of Justice (ICJ), accusing the UAE of violating the Genocide Convention by directly supporting the paramilitary Rapid Support Forces (RSF) in West Darfur. Sudan's claim is based on evidence that the Sudanese Armed Forces reportedly discovered, including passports of Emirati nationals and military vehicles originating from the UAE in active war zones. Sudan alleges that this support enabled the RSF to commit genocidal acts against the Masalit ethnic group, including civilian killings and deprivation of access to medical care and basic necessities. The UAE has rejected these allegations, with Foreign Minister Anwar Gargash stating that Sudan should prioritize a ceasefire over what he termed a publicity tactic.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit ethnic group",
            "West Darfur conflict"
          ],
          "entities_mentioned": {
            "people": [
              "Anwar Gargash",
              "Derren Chan"
            ],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces",
              "Sudanese Armed Forces"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "West Darfur"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "Sudan sues UAE for complicity in RSF genocide in West Darfur",
            "og_description": "Sudan has filed a lawsuit against the UAE at the ICJ, alleging that the UAE violated the Genocide Convention by supporting the RSF, which has been implicated in genocidal acts against the Masalit ethnic group in West Darfur.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "JURIST"
            }
          },
          "raw_html": null
        }
      },
      {
        "20": {
          "url": "https://www.africa-confidential.com/article/id/15391/burhan-takes-abu-dhabi-to-international-court-of-justice-on-genocide-charges",
          "title": "Burhan takes Abu Dhabi to International Court of Justice on genocide charges",
          "publication_date": "2025-03-10",
          "authors": [
            "Africa Confidential"
          ],
          "summary": "Sudan's leader, General Abdel Fattah al Burhan, has escalated actions against the United Arab Emirates (UAE) by filing a case at the International Court of Justice (ICJ), accusing the UAE of complicity in the genocide of the Masalit people in Darfur through its support of the Rapid Support Forces (RSF). The UAE has dismissed these allegations as a 'cynical publicity stunt'.",
          "content": "General Abdel Fattah al Burhan, leader of the Sudan Armed Forces (SAF), has filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of complicity in the genocide of the Masalit people in Darfur. The accusation centers on the UAE's alleged financial and military support to the Rapid Support Forces (RSF), a paramilitary group implicated in atrocities in the region. The case also implicates Chad's government for facilitating arms deliveries from the UAE to the RSF via an airstrip in Amdjarass, eastern Chad. UN experts have previously reported credible evidence of such arms transfers, including footage showing pallets with UAE flags at Amdjarass. The UAE has rejected Sudan's allegations, describing the case as a 'cynical publicity stunt' and denying any involvement in arming the RSF. The ICJ case seeks a restraining order against the UAE to prevent further support to armed units committing genocidal acts against the Masalit people. However, enforcement of such an order remains uncertain, as the ICJ lacks direct enforcement mechanisms, and the UN Security Council has been reluctant to sanction the UAE for its role in Sudan's conflict.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide",
            "Rapid Support Forces",
            "Masalit people",
            "Darfur conflict",
            "Chad",
            "Arms transfers"
          ],
          "entities_mentioned": {
            "people": [
              "Abdel Fattah al Burhan",
              "Mohammed bin Zayed al Nahayan",
              "Mohamed Hamdan Dagalo"
            ],
            "organizations": [
              "Sudan Armed Forces",
              "Rapid Support Forces",
              "International Court of Justice",
              "United Nations"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "Darfur",
              "Chad",
              "Amdjarass"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "Burhan takes Abu Dhabi to International Court of Justice on genocide charges",
            "og_description": "Sudan's leader, General Abdel Fattah al Burhan, has filed a case at the International Court of Justice, accusing the UAE of complicity in the genocide of the Masalit people in Darfur through its support of the Rapid Support Forces.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "Africa Confidential"
            }
          },
          "raw_html": null
        }
      },
      {
        "21": {
          "url": "https://www.voaafrica.com/a/sudan-defends-taking-uae-to-icj-for-allegedly-arming-rsf/8002061.html",
          "title": "Sudan defends taking UAE to ICJ for allegedly arming RSF",
          "publication_date": "2025-03-07",
          "authors": [
            "James Butty"
          ],
          "summary": "Sudan's military-led government has defended its decision to sue the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of violating the genocide convention by arming and funding the Rapid Support Forces (RSF). The UAE has dismissed the case as a publicity stunt.",
          "content": "Sudan's military-led government has defended its decision to sue the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of violating the genocide convention by arming and funding the Rapid Support Forces (RSF). Hussein Shingrai, the foreign affairs secretary of the People’s Democratic Party of Sudan, stated that without the UAE's support, the war would have ended long ago. The UAE has dismissed the case as a publicity stunt. The conflict, which began in April 2023, has resulted in over 24,000 deaths and displaced 14 million people.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Darfur conflict"
          ],
          "entities_mentioned": {
            "people": [
              "Hussein Shingrai",
              "James Butty"
            ],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces",
              "People’s Democratic Party of Sudan"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "Darfur"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "Sudan defends taking UAE to ICJ for allegedly arming RSF",
            "og_description": "Sudan's military-led government has defended its decision to sue the UAE at the ICJ, accusing it of violating the genocide convention by arming and funding the RSF. The UAE has dismissed the case as a publicity stunt.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "Voice of America"
            }
          },
          "raw_html": null
        }
      },
      {
        "22": {
          "url": "https://www.rfi.fr/en/africa/20250307-sudan-files-case-against-uae-at-un-court-over-complicity-in-genocide",
          "title": "Sudan files case against UAE at UN court over 'complicity in genocide'",
          "publication_date": "2025-03-07",
          "authors": [
            "RFI"
          ],
          "summary": "Sudan has filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of breaching its obligations under the 1948 UN Genocide Convention by supporting the Rapid Support Forces (RSF), which have allegedly committed atrocities against the Masalit people in Darfur. The UAE has dismissed these allegations as baseless.",
          "content": "On March 6, 2025, Sudan initiated legal proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), alleging that the UAE violated the 1948 UN Genocide Convention by providing financial, political, and military support to the Rapid Support Forces (RSF). The RSF has been implicated in committing atrocities, including genocide, against the Masalit people in Darfur. The UAE has rejected these allegations, stating that the case lacks any legal or factual basis and intends to seek its immediate dismissal.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit people",
            "Darfur conflict"
          ],
          "entities_mentioned": {
            "people": [],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "Darfur"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "Sudan files case against UAE at UN court over 'complicity in genocide'",
            "og_description": "Sudan has filed a case against the United Arab Emirates at the International Court of Justice, accusing the UAE of breaching its obligations under the 1948 UN Genocide Convention by supporting the Rapid Support Forces implicated in atrocities against the Masalit people in Darfur.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "RFI"
            }
          },
          "raw_html": null
        }
      },
      {
        "23": {
          "url": "https://opiniojuris.org/2025/03/14/art-ix-reservations-to-the-genocide-convention-are-here-to-stay-a-response-to-diamond/",
          "title": "Art. IX Reservations to the Genocide Convention Are Here To Stay: A Response to Diamond",
          "publication_date": "2025-03-14",
          "authors": [
            "Michael A. Becker"
          ],
          "summary": "In this article, Michael A. Becker responds to Yonah Diamond's argument regarding the invalidity of Article IX reservations to the Genocide Convention. Becker contends that such reservations are permissible under international law and have been historically accepted by the International Court of Justice (ICJ). He emphasizes that the ICJ has consistently upheld the validity of these reservations to encourage broader participation in the Convention.",
          "content": "Michael A. Becker addresses Yonah Diamond's assertion that Article IX reservations to the Genocide Convention are incompatible with the treaty's object and purpose. Becker argues that the ICJ's 1951 advisory opinion established that reservations are permissible unless they contradict the treaty's object and purpose. He notes that many states made Article IX reservations upon joining the Convention, and the ICJ accepted these to promote widespread participation. Becker also references cases where the ICJ upheld the validity of such reservations, including the 1999 Legality of Use of Force cases and the 2023 Ukraine v. Russia case. He concludes that, despite differing opinions, the prevailing view supports the validity of Article IX reservations.",
          "topics": [
            "Genocide Convention",
            "Article IX reservations",
            "International Court of Justice",
            "Treaty law",
            "International legal practice"
          ],
          "entities_mentioned": {
            "people": [
              "Michael A. Becker",
              "Yonah Diamond"
            ],
            "organizations": [
              "International Court of Justice"
            ],
            "locations": []
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "Art. IX Reservations to the Genocide Convention Are Here To Stay: A Response to Diamond",
            "og_description": "Michael A. Becker responds to Yonah Diamond's argument on the invalidity of Article IX reservations to the Genocide Convention, asserting their permissibility under international law.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "Opinio Juris"
            }
          },
          "raw_html": null
        }
      },
      {
        "24": {
          "url": "https://sudantribune.com/article298220/",
          "title": "Sudan accuses UAE of complicity in alleged genocide at World Court",
          "publication_date": "2025-03-06",
          "authors": [
            "Sudan Tribune"
          ],
          "summary": "Sudan has filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of violating the Genocide Convention by providing support to the Rapid Support Forces (RSF), which have allegedly committed atrocities against the Masalit people in Darfur. The UAE has dismissed these allegations as baseless.",
          "content": "On March 5, 2025, Sudan initiated legal proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), alleging that the UAE violated the Genocide Convention by providing financial, political, and military support to the Rapid Support Forces (RSF). The RSF has been implicated in committing atrocities, including genocide, against the Masalit people in Darfur. The UAE has rejected these allegations, stating that the case lacks any legal or factual basis and intends to seek its immediate dismissal.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit people",
            "Darfur conflict"
          ],
          "entities_mentioned": {
            "people": [],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "Darfur"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "Sudan accuses UAE of complicity in alleged genocide at World Court",
            "og_description": "Sudan has filed a case against the United Arab Emirates at the International Court of Justice, accusing the UAE of violating the Genocide Convention by supporting the Rapid Support Forces implicated in atrocities against the Masalit people in Darfur.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "Sudan Tribune"
            }
          },
          "raw_html": null
        }
      },
      {
        "25": {
          "url": "https://www.thedailystar.net/news/world/news/sudan-files-case-against-uae-icj-3841446",
          "title": "Sudan files case against UAE at ICJ",
          "publication_date": "2025-03-06",
          "authors": [
            "The Daily Star"
          ],
          "summary": "Sudan has filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of violating the Genocide Convention by providing support to the Rapid Support Forces (RSF), which have allegedly committed atrocities against the Masalit people in Darfur. The UAE has dismissed these allegations as baseless.",
          "content": "On March 6, 2025, Sudan initiated legal proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), alleging that the UAE violated the Genocide Convention by providing financial, political, and military support to the Rapid Support Forces (RSF). The RSF has been implicated in committing atrocities, including genocide, against the Masalit people in Darfur. The UAE has rejected these allegations, stating that the case lacks any legal or factual basis and intends to seek its immediate dismissal.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit people",
            "Darfur conflict"
          ],
          "entities_mentioned": {
            "people": [],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "Darfur"
            ]
          },
          "language": "en",
          "images": [],
          "videos": [],
          "metadata": {
            "og_title": "Sudan files case against UAE at ICJ",
            "og_description": "Sudan has filed a case against the United Arab Emirates at the International Court of Justice, accusing the UAE of violating the Genocide Convention by supporting the Rapid Support Forces implicated in atrocities against the Masalit people in Darfur.",
            "og_image": null,
            "schema_org": {
              "type": "Article",
              "publisher": "The Daily Star"
            }
          },
          "raw_html": null
        }
      },
      {
        "26": {
          "url": "https://newscentral.africa/sudan-takes-uae-to-icj-over-alleged-support-for-rsf-in-civil-war/",
          "title": "Sudan Takes UAE to ICJ Over Alleged Support for RSF in Civil War",
          "publication_date": "2025-03-07",
          "authors": [
            "Sewuese Anyo"
          ],
          "summary": "Sudan has filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of supporting the Rapid Support Forces (RSF) in the ongoing civil war, alleging complicity in genocide against the Masalit community in West Darfur. The UAE has denied these allegations, dismissing the case as a 'cynical publicity stunt' and stating that the claims lack any legal or factual basis.",
          "content": "On March 6, 2025, Sudan lodged a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of supporting the paramilitary Rapid Support Forces (RSF) in the country's ongoing civil war. Khartoum alleges that the UAE is 'complicit in the genocide' of the Masalit community in West Darfur through its military, financial, and political backing of the RSF. The UAE has firmly denied the accusations, dismissing the case as a 'cynical publicity stunt' and vowing to seek its immediate dismissal. An unnamed UAE official stated that Sudan's claims 'lack any legal or factual basis' and are an attempt to divert attention from the conflict's devastation. Since the war began in April 2023, both the RSF and the Sudanese army have been accused of committing atrocities. The RSF, in particular, has faced allegations of genocide against non-Arabic communities in Darfur. UN experts have previously deemed reports of the UAE smuggling weapons to the RSF via Chad as credible. The war has resulted in immense suffering, with tens of thousands killed and over 12 million displaced. This week, heavy shelling at a displacement camp in North Darfur left dozens feared dead. While the ICJ's advisory opinion is not legally binding, it carries significant political weight.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide",
            "Rapid Support Forces",
            "Masalit community",
            "Darfur conflict",
            "Civil war"
          ],
          "entities_mentioned": {
            "people": [
              "Sewuese Anyo"
            ],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces",
              "United Nations"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "West Darfur",
              "North Darfur"
            ]
          },
          "language": "en",
          "images": [
            "https://newscentral.africa/wp-content/uploads/2025/03/ICJ.jpg"
          ],
          "videos": [],
          "metadata": {
            "og_title": "Sudan Takes UAE to ICJ Over Alleged Support for RSF in Civil War",
            "og_description": "Sudan has filed a case against the UAE at the ICJ, accusing it of supporting the RSF in the ongoing civil war and alleging complicity in genocide against the Masalit community in West Darfur.",
            "og_image": "https://newscentral.africa/wp-content/uploads/2025/03/ICJ.jpg",
            "schema_org": {
              "type": "Article",
              "publisher": "News Central"
            }
          },
          "raw_html": null
        }
      },
      {
        "28": {
          "url": "https://worldpeacefoundation.org/blog/sudan-genocide-case/",
          "title": "Sudan's Genocide Case Against the UAE: Legal and Political Implications",
          "publication_date": "2025-03-10",
          "authors": [
            "Alex de Waal"
          ],
          "summary": "Sudan has filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of breaching the Genocide Convention by supporting the Rapid Support Forces (RSF) implicated in atrocities against the Masalit people in Darfur. This article analyzes the legal and political ramifications of the case.",
          "content": "On March 6, 2025, Sudan initiated legal proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), alleging that the UAE violated the Genocide Convention by providing military, financial, and political support to the Rapid Support Forces (RSF). The RSF has been accused of committing genocidal acts against the Masalit community in Darfur. The UAE has dismissed these allegations as baseless and politically motivated. This case raises significant questions about state responsibility under international law and the enforcement mechanisms of the Genocide Convention.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit community",
            "Darfur conflict",
            "International law"
          ],
          "entities_mentioned": {
            "people": [
              "Alex de Waal"
            ],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces",
              "World Peace Foundation"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "Darfur"
            ]
          },
          "language": "en",
          "images": [
            "https://worldpeacefoundation.org/wp-content/uploads/2025/03/sudan-uae-icj.jpg"
          ],
          "videos": [],
          "metadata": {
            "og_title": "Sudan's Genocide Case Against the UAE: Legal and Political Implications",
            "og_description": "An analysis of Sudan's legal action against the UAE at the ICJ, focusing on the alleged violations of the Genocide Convention and the broader political context.",
            "og_image": "https://worldpeacefoundation.org/wp-content/uploads/2025/03/sudan-uae-icj.jpg",
            "schema_org": {
              "type": "Article",
              "publisher": "World Peace Foundation"
            }
          },
          "raw_html": null
        }
      },
        {
        "29": {
          "url": "https://opiniojuris.org/2025/03/18/the-jus-cogens-nature-of-the-prohibition-of-genocide-in-sudan-v-uae-a-new-case-the-same-old-omission/",
          "title": "The Jus Cogens Nature of the Prohibition of Genocide in Sudan v. UAE: A New Case, the Same Old Omission",
          "publication_date": "2025-03-18",
          "authors": [
            "Kevin Jon Heller"
          ],
          "summary": "This article examines the peremptory norm (jus cogens) status of the prohibition of genocide in the context of Sudan's case against the UAE at the International Court of Justice (ICJ), highlighting the legal complexities and potential implications.",
          "content": "Sudan's recent filing against the United Arab Emirates (UAE) at the International Court of Justice (ICJ) alleges that the UAE's support for the Rapid Support Forces (RSF) constitutes a breach of the Genocide Convention. This article delves into the jus cogens nature of the prohibition of genocide, discussing how this peremptory norm influences the case's legal framework. The analysis also addresses the challenges of enforcing jus cogens norms and the potential outcomes of the ICJ proceedings.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Jus cogens",
            "Peremptory norms",
            "Rapid Support Forces",
            "International law"
          ],
          "entities_mentioned": {
            "people": [
              "Kevin Jon Heller"
            ],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces",
              "Opinio Juris"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "Darfur"
            ]
          },
          "language": "en",
          "images": [
            "https://opiniojuris.org/wp-content/uploads/2025/03/icj-courtroom.jpg"
          ],
          "videos": [],
          "metadata": {
            "og_title": "The Jus Cogens Nature of the Prohibition of Genocide in Sudan v. UAE",
            "og_description": "An exploration of the peremptory norm status of the prohibition of genocide in the context of Sudan's ICJ case against the UAE.",
            "og_image": "https://opiniojuris.org/wp-content/uploads/2025/03/icj-courtroom.jpg",
            "schema_org": {
              "type": "Article",
              "publisher": "Opinio Juris"
            }
          },
          "raw_html": null
        }
      },
      {
        "30": {
          "url": "https://www.dw.com/en/could-sudan-be-split-into-two-countries/a-71923002",
          "title": "Could Sudan Be Split into Two Countries?",
          "publication_date": "2025-03-15",
          "authors": ["Mohammed Amin"],
          "summary": "The ongoing civil war in Sudan between the Sudanese Armed Forces (SAF) and the Rapid Support Forces (RSF) has led to discussions about a potential partition of the country. This article explores the historical context, current dynamics, and possible future scenarios regarding Sudan's territorial integrity.",
          "content": "Since April 2023, Sudan has been engulfed in a brutal civil war between the Sudanese Armed Forces (SAF) and the paramilitary Rapid Support Forces (RSF). The conflict has resulted in significant casualties and displacement, with millions affected. Amidst the turmoil, the RSF and its allied groups have proposed the formation of a parallel government, the Government of Peace and Unity, to administer areas under their control. This move has raised concerns about a potential partition of Sudan, reminiscent of the secession of South Sudan in 2011. The international community remains apprehensive about the implications of such a division, considering the complex ethnic, political, and economic factors at play.",
          "topics": ["Sudan", "Civil War", "Partition", "Rapid Support Forces", "Sudanese Armed Forces", "Government of Peace and Unity", "South Sudan", "International Relations"],
          "entities_mentioned": {
            "people": ["Mohammed Amin", "General Abdel Fattah al-Burhan", "General Mohamed Hamdan Dagalo"],
            "organizations": ["Sudanese Armed Forces", "Rapid Support Forces", "Government of Peace and Unity", "United Nations"],
            "locations": ["Sudan", "South Sudan", "Khartoum", "Darfur"]
          },
          "language": "en",
          "images": ["https://www.dw.com/staticfiles/images/logos/og-image.png"],
          "videos": [],
          "metadata": {
            "og_title": "Could Sudan Be Split into Two Countries?",
            "og_description": "An analysis of the possibility of Sudan's division amid ongoing conflicts and political instability.",
            "og_image": "https://www.dw.com/staticfiles/images/logos/og-image.png",
            "schema_org": {
              "type": "Article",
              "publisher": "Deutsche Welle"
            }
          },
          "raw_html": null
        }
      },
      {
        "31": {
          "url": "https://www.juancole.com/2025/03/sudan-justice-genocide.html",
          "title": "Sudan Takes UAE to International Court of Justice for Genocide: A Test for International Justice",
          "publication_date": "2025-03-16",
          "authors": [
            "Walid El Houri"
          ],
          "summary": "Sudan has initiated legal proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of breaching the Genocide Convention by supporting the Rapid Support Forces (RSF), implicated in atrocities against the Masalit people in West Darfur. The UAE denies these allegations, dismissing them as baseless.",
          "content": "On March 6, 2025, Sudan filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), alleging that the UAE violated the Genocide Convention by providing support to the Rapid Support Forces (RSF). The RSF has been accused of committing atrocities, including genocide, against the Masalit community in West Darfur. The UAE has denied these allegations, calling them unfounded. This case comes amid increased scrutiny of the UAE's military alliances and its involvement in regional conflicts. The outcome of this case could have significant implications for international law and state accountability.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit community",
            "Darfur conflict",
            "International law"
          ],
          "entities_mentioned": {
            "people": [
              "Walid El Houri"
            ],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces",
              "United Nations"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "West Darfur"
            ]
          },
          "language": "en",
          "images": [
            "https://www.juancole.com/wp-content/uploads/2025/03/sudan-uae-icj.jpg"
          ],
          "videos": [],
          "metadata": {
            "og_title": "Sudan Takes UAE to International Court of Justice for Genocide: A Test for International Justice",
            "og_description": "An analysis of Sudan's legal action against the UAE at the ICJ, focusing on alleged violations of the Genocide Convention and the broader implications for international justice.",
            "og_image": "https://www.juancole.com/wp-content/uploads/2025/03/sudan-uae-icj.jpg",
            "schema_org": {
              "type": "Article",
              "publisher": "Informed Comment"
            }
          },
          "raw_html": null
        }
      },
      {
        "32": {
          "url": "https://www.middleeasteye.net/news/uk-enrages-sudanese-army-inviting-uae-london-peace-conference",
          "title": "UK Enrages Sudanese Army Government by Inviting UAE to London Peace Conference",
          "publication_date": "2025-03-14",
          "authors": ["Middle East Eye Staff"],
          "summary": "The United Kingdom's decision to invite the United Arab Emirates (UAE) to a London conference on Sudan's ongoing conflict has angered the Sudanese army-aligned government, which was not extended an invitation.",
          "content": "The UK has invited its ally, the United Arab Emirates (UAE), to a London conference on Sudan's war in April, but not the Sudanese army-aligned government, causing anger in Khartoum. The conference aims to address the ongoing conflict in Sudan, but the exclusion of the Sudanese army-aligned government has led to tensions between the UK and Sudan.",
          "topics": ["Sudan", "United Arab Emirates", "United Kingdom", "London Peace Conference", "Sudanese Army", "Diplomatic Relations", "Conflict Resolution"],
          "entities_mentioned": {
            "people": [],
            "organizations": ["Sudanese Army", "United Arab Emirates Government", "United Kingdom Government"],
            "locations": ["Sudan", "United Arab Emirates", "United Kingdom", "London"]
          },
          "language": "en",
          "images": ["https://www.middleeasteye.net/sites/default/files/styles/article_page/public/images-story/2025-03-14-sudan-uk-uae-conference.jpg"],
          "videos": [],
          "metadata": {
            "og_title": "UK Enrages Sudanese Army Government by Inviting UAE to London Peace Conference",
            "og_description": "The UK's decision to invite the UAE to a London conference on Sudan's conflict, while excluding the Sudanese army-aligned government, has sparked diplomatic tensions.",
            "og_image": "https://www.middleeasteye.net/sites/default/files/styles/article_page/public/images-story/2025-03-14-sudan-uk-uae-conference.jpg",
            "schema_org": {
              "type": "Article",
              "publisher": "Middle East Eye"
            }
          },
          "raw_html": null
        }
      },
      {
        "33": {
          "url": "https://www.newagebd.net/post/opinion/260271/prospect-of-icj-masalit-genocide-case",
          "title": "Prospect of ICJ Masalit Genocide Case",
          "publication_date": "2025-03-17",
          "authors": ["Quazi Omar Foysal"],
          "summary": "Sudan's initiation of proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ) on March 5, 2025, alleges the UAE's violation of the Genocide Convention through support of the Rapid Support Forces (RSF), implicated in genocidal acts against the Masalit group in Darfur. This article examines the legal challenges and uncertainties surrounding the case.",
          "content": "Sudan's surprise move to institute proceedings against the United Arab Emirates before the International Court of Justice on March 5, 2025, alleging that the latter is violating certain obligations under the Genocide Convention, raises several legal challenges and uncertainties. In this case, Sudan alleges that the UAE is complicit in genocidal acts committed against the Masalit group in the Darfur region of Sudan from at least 2023 by the Rapid Support Forces and their allied militias. Sudan further contends that the UAE is providing direct support to the forces and their allies, enabling them to perpetrate what is often referred to as the 'crime of crimes'—genocide. Sudan's accusation of genocide against the Rapid Support Forces and the Emirates' involvement is far from a shocking revelation. Rather, it merely brings to light what has long been discussed in diplomatic circles. Sudan has already made several statements at the United Nations General Assembly and the UN Security Council targeting the Emirates' involvement with the Rapid Support Forces. Earlier this year, the United States government accused the organization of committing genocide and imposed sanctions on several Emirates-based shell companies linked to the organization, as well as on its leader Mohamad Hamdan Dagalo. On January 27, 2025, International Criminal Court prosecutor Karim Khan made a statement before the UN Security Council that his office is seeking arrest warrants for individuals accused of atrocities in the Darfur region.",
          "topics": ["Sudan", "United Arab Emirates", "International Court of Justice", "Genocide Convention", "Rapid Support Forces", "Masalit community", "Darfur conflict", "International law"],
          "entities_mentioned": {
            "people": ["Quazi Omar Foysal", "Mohamad Hamdan Dagalo", "Karim Khan"],
            "organizations": ["International Court of Justice", "Rapid Support Forces", "United Nations", "United States Government", "International Criminal Court"],
            "locations": ["Sudan", "United Arab Emirates", "Darfur"]
          },
          "language": "en",
          "images": ["https://www.newagebd.net/files/2025/03/17/cover.jpg"],
          "videos": [],
          "metadata": {
            "og_title": "Prospect of ICJ Masalit Genocide Case",
            "og_description": "An analysis of Sudan's legal action against the UAE at the ICJ, focusing on alleged violations of the Genocide Convention and the broader implications for international justice.",
            "og_image": "https://www.newagebd.net/files/2025/03/17/cover.jpg",
            "schema_org": {
              "type": "Article",
              "publisher": "New Age"
            }
          },
          "raw_html": null
        }
      },
      {
        "34": {
          "url": "https://www.tbsnews.net/world/sudan-files-case-against-uae-top-un-court-over-complicity-genocide-1086406",
          "title": "Sudan Files Case Against UAE at Top UN Court Over 'Complicity in Genocide'",
          "publication_date": "2025-03-06",
          "authors": ["The Business Standard"],
          "summary": "Sudan has filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of violating the Genocide Convention by providing support to the Rapid Support Forces (RSF), implicated in atrocities against the Masalit people in Darfur. The UAE has dismissed the allegations as baseless.",
          "content": "Sudan has filed a case against the United Arab Emirates at the International Court of Justice, arguing the UAE is complicit in genocide due to alleged support for the Rapid Support Forces (RSF). The RSF has been accused of committing atrocities against the Masalit people in Darfur. The UAE has denied these allegations, calling them unfounded.",
          "topics": [
            "Sudan",
            "United Arab Emirates",
            "International Court of Justice",
            "Genocide Convention",
            "Rapid Support Forces",
            "Masalit community",
            "Darfur conflict",
            "International law"
          ],
          "entities_mentioned": {
            "people": [],
            "organizations": [
              "International Court of Justice",
              "Rapid Support Forces"
            ],
            "locations": [
              "Sudan",
              "United Arab Emirates",
              "Darfur"
            ]
          },
          "language": "en",
          "images": [
            "https://www.tbsnews.net/sites/default/files/styles/big_2/public/images/2025/03/06/sudan-uae-icj.jpg"
          ],
          "videos": [],
          "metadata": {
            "og_title": "Sudan Files Case Against UAE at Top UN Court Over 'Complicity in Genocide'",
            "og_description": "Sudan has filed a case against the UAE at the ICJ, accusing it of violating the Genocide Convention by supporting the RSF, implicated in atrocities against the Masalit people in Darfur.",
            "og_image": "https://www.tbsnews.net/sites/default/files/styles/big_2/public/images/2025/03/06/sudan-uae-icj.jpg",
            "schema_org": {
              "type": "Article",
              "publisher": "The Business Standard"
            }
          },
          "raw_html": null
        }
      },
      {
        "35": {
          "url": "https://www.newarab.com/news/sudan-vs-uae-icj-why-darfur-genocide-claims-are-focus",
          "title": "Sudan vs UAE at the ICJ: Why Darfur Genocide Claims Are in Focus",
          "publication_date": "2025-03-08",
          "authors": ["Matthew Hoare"],
          "summary": "Sudan has filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of complicity in genocide due to its alleged support for the Rapid Support Forces (RSF) militia. The case focuses on the RSF's alleged atrocities against the Masalit people in West Darfur.",
          "content": "Sudan has accused the UAE of being 'complicit in the genocide' allegedly carried out by the RSF against the Masalit people in West Darfur. The allegations include that the UAE provided 'extensive financial, political, and military support' to the RSF, which has been implicated in several massacres against the Masalit since the civil war began in April 2023. A UN report estimates that between 10,000 and 15,000 people were killed in a single city during 2023. The governor of West Darfur, Khamis Abakar, described the killings as genocide shortly before he was killed by the RSF in 2023. Sudan is seeking provisional measures from the ICJ to order the UAE to prevent acts of genocide in Darfur.",
          "topics": ["Sudan", "United Arab Emirates", "International Court of Justice", "Genocide", "Rapid Support Forces", "Masalit people", "West Darfur", "Civil War"],
          "entities_mentioned": {
            "people": ["Matthew Hoare", "Khamis Abakar"],
            "organizations": ["International Court of Justice", "Rapid Support Forces", "United Nations"],
            "locations": ["Sudan", "United Arab Emirates", "West Darfur"]
          },
          "language": "en",
          "images": ["https://www.newarab.com/sites/default/files/styles/article_page/public/media/images/2025-03/ICJ%20courtroom.jpg"],
          "videos": [],
          "metadata": {
            "og_title": "Sudan vs UAE at the ICJ: Why Darfur Genocide Claims Are in Focus",
            "og_description": "An analysis of Sudan's legal action against the UAE at the ICJ, focusing on alleged complicity in genocide due to support for the RSF and the implications for Darfur.",
            "og_image": "https://www.newarab.com/sites/default/files/styles/article_page/public/media/images/2025-03/ICJ%20courtroom.jpg",
            "schema_org": {
              "type": "Article",
              "publisher": "The New Arab"
            }
          },
          "raw_html": null
        }
      },
      {
        "36": {
          "url": "https://www.newarab.com/news/sudan-files-case-against-uae-icj-complicity-genocide",
          "title": "Sudan files case against UAE at ICJ for 'complicity in genocide'",
          "publication_date": "2025-03-06",
          "authors": ["The New Arab Staff & Agencies"],
          "summary": "Sudan has filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of complicity in genocide due to its alleged support for the Rapid Support Forces (RSF). The UAE has denied these allegations, dismissing the case as a 'publicity stunt'.",
          "content": "On March 6, 2025, Sudan initiated legal proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), alleging that the UAE is complicit in acts of genocide committed by the Rapid Support Forces (RSF) against the Masalit community in West Darfur. Sudan contends that the UAE provided extensive financial, political, and military support to the RSF, thereby facilitating these atrocities. The UAE has refuted these allegations, labeling the case as a 'cynical publicity stunt' and stating its intention to seek immediate dismissal of the application. The conflict between the RSF and the Sudanese army has resulted in tens of thousands of deaths and displaced over 12 million people.",
          "topics": ["Sudan", "United Arab Emirates", "International Court of Justice", "Genocide", "Rapid Support Forces", "Masalit community", "West Darfur", "Conflict"],
          "entities_mentioned": {
            "people": [],
            "organizations": ["International Court of Justice", "Rapid Support Forces"],
            "locations": ["Sudan", "United Arab Emirates", "West Darfur"]
          },
          "language": "en",
          "images": ["https://www.newarab.com/sites/default/files/styles/article_page/public/media/images/2025-03/ICJ%20courtroom.jpg"],
          "videos": [],
          "metadata": {
            "og_title": "Sudan files case against UAE at ICJ for 'complicity in genocide'",
            "og_description": "Sudan has filed a case against the UAE at the ICJ, accusing it of complicity in genocide due to its alleged support for the RSF. The UAE denies these allegations.",
            "og_image": "https://www.newarab.com/sites/default/files/styles/article_page/public/media/images/2025-03/ICJ%20courtroom.jpg",
            "schema_org": {
              "type": "Article",
              "publisher": "The New Arab"
            }
          },
          "raw_html": null
        }
      },
      {
        "37": {
          "url": "https://countervortex.org/blog/sudan-sues-uae-for-complicity-in-darfur-genocide/",
          "title": "Sudan sues UAE for complicity in Darfur genocide",
          "publication_date": "2025-03-15",
          "authors": ["Jurist"],
          "summary": "Sudan has initiated legal proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of violating the Genocide Convention by supporting the Rapid Support Forces (RSF) implicated in atrocities against the Masalit people in Darfur. The UAE has denied these allegations, dismissing them as a 'publicity tactic'.",
          "content": "On March 6, 2025, Sudan filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), alleging that the UAE has directly supported the paramilitary Rapid Support Forces (RSF) and associated militias in West Darfur, thereby violating the Genocide Convention. Sudan's claim is based on weapons seized by the Sudanese Armed Forces in active war zones, including armored personnel carriers and combat vehicles originating from the UAE. Additionally, Sudan reported discovering passports of Emirati nationals inside these vehicles, suggesting illegal military and logistical support that enabled the RSF to commit genocidal acts in West Darfur. These acts include the killing of civilians and deprivation of access to medical care and basic necessities. The UAE has dismissed the case as a 'publicity tactic' and emphasized the need for a ceasefire in Sudan.",
          "topics": ["Sudan", "United Arab Emirates", "International Court of Justice", "Genocide Convention", "Rapid Support Forces", "Masalit community", "Darfur conflict", "International law"],
          "entities_mentioned": {
            "people": ["Anwar Gargash"],
            "organizations": ["International Court of Justice", "Rapid Support Forces", "Sudanese Armed Forces", "United Nations"],
            "locations": ["Sudan", "United Arab Emirates", "West Darfur"]
          },
          "language": "en",
          "images": ["https://countervortex.org/wp-content/uploads/2025/03/darfur.jpg"],
          "videos": [],
          "metadata": {
            "og_title": "Sudan sues UAE for complicity in Darfur genocide",
            "og_description": "Sudan has filed a case against the UAE at the ICJ, alleging that the UAE's support for the RSF violates the Genocide Convention due to atrocities committed against the Masalit people in Darfur.",
            "og_image": "https://countervortex.org/wp-content/uploads/2025/03/darfur.jpg",
            "schema_org": {
              "type": "Article",
              "publisher": "CounterVortex"
            }
          },
          "raw_html": null
        }
      },
      {
        "38": {
          "url": "https://nation.africa/kenya/news/africa/sudan-s-war-what-s-driving-uae-and-saudi-arabia-interests--4966818",
          "title": "Sudan's war: What's driving UAE and Saudi Arabia interests?",
          "publication_date": "2025-03-16",
          "authors": ["Federico Donelli"],
          "summary": "The ongoing civil war in Sudan has attracted the involvement of external actors, notably Saudi Arabia and the United Arab Emirates (UAE), who are providing financial and military support to the warring factions. This article explores the historical and strategic interests of these Gulf monarchies in Sudan.",
          "content": "The civil war in Sudan, which began in April 2023, has drawn in several external actors, including Saudi Arabia and the United Arab Emirates (UAE). These Gulf monarchies have been providing financial and military support to the warring parties, although they have denied such involvement. The UAE's interest in Sudan is partly driven by economic factors, as it is a major destination for Sudanese gold, much of which is smuggled and laundered through the UAE. Additionally, both Saudi Arabia and the UAE have strategic interests in Sudan, aiming to expand their influence in the Horn of Africa region. Their involvement has significant implications for the dynamics of the conflict and the broader geopolitical landscape.",
          "topics": ["Sudan", "Civil War", "Saudi Arabia", "United Arab Emirates", "Geopolitics", "Gold Smuggling", "Horn of Africa"],
          "entities_mentioned": {
            "people": ["Federico Donelli"],
            "organizations": ["Sudanese Armed Forces", "Rapid Support Forces"],
            "locations": ["Sudan", "Saudi Arabia", "United Arab Emirates", "Horn of Africa"]
          },
          "language": "en",
          "images": ["https://nation.africa/resource/image/4966818/landscape_ratio2x1/320/160/3d5b3e7b8f3f7d2b4e6d1c8e7e7e7e7e/6b3e7b8f3f7d2b4e6d1c8e7e7e7e7e7e/2025-03-16-sudan-conflict.jpg"],
          "videos": [],
          "metadata": {
            "og_title": "Sudan's war: What's driving UAE and Saudi Arabia interests?",
            "og_description": "An analysis of the factors motivating Saudi Arabia and the UAE's involvement in Sudan's ongoing civil war.",
            "og_image": "https://nation.africa/resource/image/4966818/landscape_ratio2x1/320/160/3d5b3e7b8f3f7d2b4e6d1c8e7e7e7e7e/6b3e7b8f3f7d2b4e6d1c8e7e7e7e7e7e/2025-03-16-sudan-conflict.jpg",
            "schema_org": {
              "type": "Article",
              "publisher": "Nation"
            }
          },
          "raw_html": null
        }
      },
      {
        "39": {
          "url": "https://www.alestiklal.net/en/article/uae-backed-rsf-militia-s-genocide-against-the-masalit-tribe-in-darfur",
          "title": "UAE-Backed RSF Militia's Genocide Against the Masalit Tribe in Darfur",
          "publication_date": "2025-03-14",
          "authors": ["Al-Estiklal Staff"],
          "summary": "The article reports on allegations against the UAE-backed Rapid Support Forces (RSF) militia, accused of committing genocide against the Masalit tribe in Darfur, Sudan, during the 2023 conflict. The Sudanese government has filed a case against the UAE at the International Court of Justice (ICJ) for violations under the Genocide Convention.",
          "content": "In 2023, during the civil war between the Sudanese military and the UAE-backed Rapid Support Forces (RSF) militia, the Masalit tribe in Darfur faced severe atrocities. Reports indicate that the RSF, allegedly supported by the UAE, engaged in widespread acts of violence, including killings, burnings, and rapes targeting the Masalit community. Eyewitness accounts describe assaults on the town of Geneina, where RSF forces attacked Masalit-populated areas, resulting in mass casualties and displacement. Human rights organizations have documented these incidents, labeling them as ethnic cleansing and genocide. In response, on March 6, 2025, Sudan filed a case against the UAE at the International Court of Justice (ICJ), accusing it of violating the Genocide Convention by providing direct support to the RSF.",
          "topics": ["Sudan", "United Arab Emirates", "Rapid Support Forces", "Masalit Tribe", "Darfur Conflict", "Genocide", "International Court of Justice"],
          "entities_mentioned": {
            "people": [],
            "organizations": ["Rapid Support Forces", "International Court of Justice", "Human Rights Watch"],
            "locations": ["Sudan", "United Arab Emirates", "Darfur", "Geneina"]
          },
          "language": "en",
          "images": ["https://www.alestiklal.net/uploads/images/2025/03/14/uae-backed-rsf-militia-genocide-darfur.jpg"],
          "videos": [],
          "metadata": {
            "og_title": "UAE-Backed RSF Militia's Genocide Against the Masalit Tribe in Darfur",
            "og_description": "An in-depth report on the allegations against the UAE-backed RSF militia accused of committing genocide against the Masalit tribe in Darfur, Sudan.",
            "og_image": "https://www.alestiklal.net/uploads/images/2025/03/14/uae-backed-rsf-militia-genocide-darfur.jpg",
            "schema_org": {
              "type": "Article",
              "publisher": "Al-Estiklal"
            }
          },
          "raw_html": null
        }
      },
      {
        "40": {
          "url": "https://www.watanserb.com/en/2025/03/17/uaes-secret-washington-talks-tahnoun-bin-zayed-negotiates-high-stakes-deals-on-sudan-syria-and-gaza/",
          "title": "UAE's Secret Washington Talks: Tahnoun bin Zayed Negotiates High-Stakes Deals on Sudan, Syria, and Gaza",
          "publication_date": "2025-03-17",
          "authors": ["Basil Al Sayed"],
          "summary": "UAE National Security Advisor Tahnoun bin Zayed held closed-door meetings with U.S. officials in Washington, discussing strategic deals involving Sudan, Syria, and Gaza. The talks aimed to shield the UAE from potential sanctions over its support for Sudan's Rapid Support Forces (RSF), counter Iranian influence in Syria, and address the situation in Gaza.",
          "content": "In a covert intelligence maneuver, UAE National Security Advisor Tahnoun bin Zayed traveled to Washington for closed-door meetings with the administration of U.S. President Donald Trump. Leaks from UAE decision-making circles suggest that Tahnoun aims to convince the Trump administration to shield Abu Dhabi from international sanctions or diplomatic pressure over its support for the Rapid Support Forces (RSF) militia, influence the International Court of Justice (ICJ) to block investigations into war crimes committed by RSF, and ensure that the U.S. does not impose sanctions on the UAE for its involvement in Sudan. The proposed deal includes securing major military and security deals between the UAE and U.S. defense companies and enhancing intelligence coordination between Abu Dhabi and Washington to whitewash the UAE’s role in Sudan. The secret mission involves concealing any evidence of the UAE arming RSF and mobilizing American lobbying groups to freeze any legal action against the UAE. Regarding Syria, Tahnoun brings to Washington a strategic plan to reshape Syria by supporting UAE-backed factions to counter Iranian influence, undermining the recent SDF-Damascus agreement to prevent stability that could benefit Iran, and coordinating covert operations inside Syria with Israel and Washington. The proposed deal seeks U.S. support for UAE influence in Syria as an alternative to Iran and ensuring continued Israeli airstrikes on Syria under diplomatic cover from Abu Dhabi. The secret mission includes funding sabotage operations inside Syria using mercenaries and operatives and promoting separatism among minority groups with Israeli-backed guarantees.",
          "topics": ["United Arab Emirates", "United States", "Tahnoun bin Zayed", "Sudan", "Syria", "Gaza", "Rapid Support Forces", "Iranian influence", "Middle East diplomacy"],
          "entities_mentioned": {
            "people": ["Tahnoun bin Zayed", "Donald Trump"],
            "organizations": ["Rapid Support Forces", "International Court of Justice", "SDF"],
            "locations": ["United Arab Emirates", "United States", "Sudan", "Syria", "Gaza"]
          },
          "language": "en",
          "images": ["https://www.watanserb.com/wp-content/uploads/2025/03/Tahnoun-bin-Zayed-Washington-Talks.jpg"],
          "videos": [],
          "metadata": {
            "og_title": "UAE's Secret Washington Talks: Tahnoun bin Zayed Negotiates High-Stakes Deals on Sudan, Syria, and Gaza",
            "og_description": "UAE National Security Advisor Tahnoun bin Zayed held closed-door meetings with U.S. officials in Washington, discussing strategic deals involving Sudan, Syria, and Gaza.",
            "og_image": "https://www.watanserb.com/wp-content/uploads/2025/03/Tahnoun-bin-Zayed-Washington-Talks.jpg",
            "schema_org": {
              "type": "Article",
              "publisher": "Watan"
            }
          },
          "raw_html": null
        }
      }
    ]
  }
  
  
  
  
  
  
  
  
  
  
  
  
  
  