{
    "articles": [
      {
        "1": {
          "url": "https://www.aljazeera.com/news/2025/3/6/sudan-files-case-against-uae-at-top-un-court-over-complicity-in-genocide",
          "title": "Sudan files case against UAE at top UN court over ‘complicity in genocide’",
          "description": "Khartoum accuses the UAE of backing the Rapid Support Forces, which is fighting the Sudanese army in a year-long civil war.",
          "keywords": "Sudan,UAE,ICJ,Sudan conflict,Rapid Support Forces (RSF)",
          "author": null,
          "publication_date": null,
          "language": "en",
          "favicon_url": "https://www.aljazeera.com/wp-content/uploads/2017/01/aj-favicon.png?w=32&resize=32%2C32",
          "og_title": "Sudan files case against UAE at top UN court over ‘complicity in genocide’",
          "og_description": "Khartoum accuses the UAE of backing the Rapid Support Forces, which is fighting the Sudanese army in a year-long civil war.",
          "og_image": "https://www.aljazeera.com/wp-content/uploads/2024/03/2024-03-05T164135Z_1297943943_RC2666AU4U41_RTRMADP_3_SUDAN-CONFLICT.jpg?resize=1200%2C630",
          "og_url": "https://www.aljazeera.com/news/2025/3/6/sudan-files-case-against-uae-at-top-un-court-over-complicity-in-genocide",
          "og_type": "article",
          "headings": [
            "News",
            "Sudan files case against UAE at top UN court over ‘complicity in genocide’",
            "Khartoum accuses the UAE of backing the Rapid Support Forces, which is fighting the Sudanese army in a year-long civil war.",
            "By",
            "Abdel Bari Atwan",
            "Published On 6 Mar 2025",
            "updated 6 Mar 2025",
            "Timeline of the Sudan conflict",
            "Sudan’s army and the paramilitary Rapid Support Forces (RSF) have been fighting for almost a year [File: Reuters]",
            "The Sudanese government has filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing it of supporting the rival Rapid Support Forces (RSF) in the country’s year-long civil war.",
            "In its application to the ICJ, also known as the World Court, Sudan said it was seeking to “obtain redress for the UAE’s violations of Sudan’s sovereignty, its interference in Sudan’s internal affairs, and its use of force against the Sudanese people”.",
            "The Sudanese Ministry of Foreign Affairs said in a statement on Wednesday that it had presented evidence that the UAE provided weapons and financial and political support to the RSF.",
            "It added that the UAE’s actions had fuelled the conflict and caused widespread destruction and human rights abuses.",
            "The UAE has not yet officially responded to the accusations. However, it has previously denied providing military support to any of the warring parties in Sudan.",
            "The ICJ has the authority to issue binding rulings on disputes between states. However, its decisions are not always enforced.",
            "The conflict in Sudan erupted in April 2024, after months of escalating tensions between the army and the RSF. The fighting has killed thousands of people and displaced millions more.",
            "The UAE has been a major investor in Sudan in recent years. It has also been a key ally of the Sudanese military.",
            "Some analysts say that the UAE’s support for the RSF is aimed at undermining the Sudanese government and gaining influence in the country.",
            "Others say that the UAE is simply trying to protect its interests in Sudan and prevent the country from descending into further chaos.",
            "The Sudanese government has been under increasing pressure to end the conflict. In recent weeks, it has launched a new military offensive against the RSF.",
            "It has also called on the international community to put pressure on the UAE to stop supporting the RSF.",
            "The ICJ is expected to hold hearings on the case in the coming months. Its ruling could have a significant impact on the conflict in Sudan.",
            "More on Sudan",
            "In Pictures",
            "Sudan’s forgotten war: ‘We are slowly dying here’",
            "Sudan’s forgotten war: ‘We are slowly dying here’",
            "News",
            "Sudan’s army chief visits Eritrea as fighting intensifies",
            "Sudan’s army chief visits Eritrea as fighting intensifies",
            "News",
            "Sudan’s army advances on key city, fighting continues in Khartoum",
            "Sudan’s army advances on key city, fighting continues in Khartoum",
            "News",
            "Sudan accuses UAE of backing RSF, files case at ICJ",
            "Sudan accuses UAE of backing RSF, files case at ICJ"
          ],
          "domain_name": "www.aljazeera.com"
        }
      },
      {
        "2": {
          "url": "https://www.bbc.com/news/articles/c3w1nzpg5dgo",
          "title": "Sudan war: UAE rejects accusations of fuelling conflict",
          "description": "The UAE says it is committed to de-escalation and denies arming a paramilitary group fighting the army.",
          "keywords": null,
          "author": null,
          "publication_date": null,
          "language": "en",
          "favicon_url": "https://www.bbc.com/favicon.ico",
          "og_title": "Sudan war: UAE rejects accusations of fuelling conflict",
          "og_description": "The UAE says it is committed to de-escalation and denies arming a paramilitary group fighting the army.",
          "og_image": "https://ichef.bbci.co.uk/news/1024/cpsprodpb/16629/production/_132644869_gettyimages-1774444922.jpg",
          "og_url": "https://www.bbc.com/news/articles/c3w1nzpg5dgo",
          "og_type": "article",
          "headings": [
            "Sudan war: UAE rejects accusations of fuelling conflict",
            "Published",
            "1 day ago",
            "Related Topics",
            "More on this story"
          ],
          "domain_name": "www.bbc.com"
        }
      },
      {
        "3": {
          "url": "https://foreignpolicy.com/2025/03/17/sudan-icj-genocide-case-uae-rsf-support/",
          "title": "Sudan Takes the UAE to Court for Backing a Brutal Militia",
          "description": "Khartoum’s lawsuit against Abu Dhabi at the International Court of Justice could open a new front in the country’s civil war.",
          "keywords": "Africa, United Arab Emirates, Sudan, International Court of Justice",
          "author": "Cameron Drouin",
          "publication_date": null,
          "language": "en-US",
          "favicon_url": "https://foreignpolicy.com/wp-content/uploads/2023/05/FP_Favicon_400x400.png?w=32",
          "og_title": "Sudan Takes the UAE to Court for Backing a Brutal Militia",
          "og_description": "Khartoum’s lawsuit against Abu Dhabi at the International Court of Justice could open a new front in the country’s civil war.",
          "og_image": "https://foreignpolicy.com/wp-content/uploads/2024/03/GettyImages-2154299323.jpg?w=1024",
          "og_url": "https://foreignpolicy.com/2025/03/17/sudan-icj-genocide-case-uae-rsf-support/",
          "og_type": "article",
          "headings": [
            "Sudan Takes the UAE to Court for Backing a Brutal Militia",
            "Khartoum’s lawsuit against Abu Dhabi at the International Court of Justice could open a new front in the country’s civil war.",
            "By Cameron Drouin",
            "March 17, 2025",
            "A Sudanese soldier stands guard in Khartoum on Oct. 1.",
            "Sudan has accused the United Arab Emirates of backing the Rapid Support Forces.  AFP via Getty Images",
            "The Sudanese government has filed a case before the International Court of Justice (ICJ) accusing the United Arab Emirates of funding the country’s main paramilitary group, the Rapid Support Forces (RSF), which is accused of carrying out widespread atrocities. The move could open a new front in the country’s nearly yearlong civil war.",
            "In its application to the ICJ, filed on Wednesday, the Sudanese government accuses the UAE of violating international law by supporting the RSF, which is fighting to overthrow the government. The government alleges that the UAE has provided the RSF with financial and military support, including weapons, training, and logistical assistance.",
            "“The UAE has directly engaged in military actions against Sudan,” the application reads. “The UAE has provided financial support to the RSF, knowing that this support would be used to finance military operations against Sudan.”",
            "The UAE has denied the allegations, calling them “baseless and without merit.” In a statement, the UAE’s Ministry of Foreign Affairs said that it “remains committed to supporting a peaceful resolution to the conflict in Sudan” and that it “has never provided military support to any party in the conflict.”",
            "The ICJ is the principal judicial organ of the United Nations and has the authority to hear disputes between states. Its rulings are binding, but it has no power to enforce them. The court has previously heard cases involving allegations of state support for armed groups, including a case brought by Bosnia and Herzegovina against Serbia and Montenegro in 1993.",
            "The Sudanese government’s decision to take the UAE to court is a significant escalation of the conflict. It reflects the government’s growing frustration with the UAE’s alleged support for the RSF, which has been accused of carrying out widespread human rights abuses, including the massacre of civilians.",
            "“This is a very serious step,” said Ahmed Hussein, a Sudanese lawyer and human rights activist. “It shows that the government is determined to hold the UAE accountable for its actions.”",
            "The case could also have broader implications for the region. The UAE has been accused of supporting armed groups in other countries, including Libya and Yemen. A ruling against the UAE in the Sudan case could embolden other countries to take similar action.",
            "“This case could set a precedent for other countries that have been affected by the UAE’s actions,” said Hussein. “It could send a message that the UAE cannot act with impunity.”",
            "The ICJ is expected to hold hearings on the case in the coming months. It is unclear when the court will issue a ruling.",
            "Read More",
            "Most Popular",
            "The Saudi-U.S. Split Is Now Official",
            "The Saudi-U.S. Split Is Now Official",
            "Europe’s Dangerous Dance With the Caucasus",
            "Europe’s Dangerous Dance With the Caucasus",
            "Why Ukraine Can’t Win",
            "Why Ukraine Can’t Win",
            "The New Face of the Chinese Dream Is a Nightmare",
            "The New Face of the Chinese Dream Is a Nightmare",
            "What’s Wrong With U.S. Policy Toward Africa",
            "What’s Wrong With U.S. Policy Toward Africa"
          ],
          "domain_name": "foreignpolicy.com"
        }
      },
      {
        "4": {
          "url": "https://www.reuters.com/world/sudan-launches-case-against-united-arab-emirates-world-court-2025-03-06/",
          "title": "Sudan launches case against United Arab Emirates at World Court",
          "description": "Sudan has launched a case against the United Arab Emirates at the International Court of Justice (ICJ), accusing it of supporting the paramilitary Rapid Support Forces (RSF) which is battling Sudan's army, the Sudanese foreign ministry said on Wednesday.",
          "keywords": "WRD, MEA, ASIA, AFRI, GEN, DIPL, GOV, LAW, LEG",
          "author": null,
          "publication_date": "2025-03-06T17:13:16+00:00",
          "language": "en",
          "favicon_url": "https://www.reuters.com/ Static files/images/favicons/reuters/reuters-32x32.png",
          "og_title": "Sudan launches case against United Arab Emirates at World Court",
          "og_description": "Sudan has launched a case against the United Arab Emirates at the International Court of Justice (ICJ), accusing it of supporting the paramilitary Rapid Support Forces (RSF) which is battling Sudan's army, the Sudanese foreign ministry said on Wednesday.",
          "og_image": "https://www.reuters.com/resizer/Fj96oFH2W0kWd1_m3n6p4FiemKY=/1200x630/filters:quality(80)/cloudfront-us-east-1.images.arcpublishing.com/reuters/ORZ5JMGN65MI7LHG2XPHWMR3F4.jpg",
          "og_url": "https://www.reuters.com/world/sudan-launches-case-against-united-arab-emirates-world-court-2025-03-06/",
          "og_type": "article",
          "headings": [
            "Top News",
            "World",
            "Africa",
            "Sudan launches case against United Arab Emirates at World Court",
            "March 6, 20251:13 PM GMT",
            "Summary",
            "ICJ is the U.N.'s top court",
            "UAE has previously denied providing military support",
            "ADVERTISEMENT",
            "Article continues after sponsor message",
            "Related Coverage",
            "Site Index",
            "Browse",
            "Wire Service"
          ],
          "domain_name": "www.reuters.com"
        }
      },
      {
        "5": {
          "url": "https://religionunplugged.com/news/2025/3/11/sudan-takes-uae-to-world-court-over-alleged-complicity-in-genocide",
          "title": "Sudan Takes UAE to World Court Over Alleged Complicity in Genocide",
          "description": "Sudan has filed a case against the United Arab Emirates at the International Court of Justice, accusing the Gulf nation of supporting a paramilitary group that is accused of atrocities.",
          "keywords": "sudan, uae, united arab emirates, icj, international court of justice, genocide, sudan war, rsf, rapid support forces, mohammed dagalo, hemedti, khartoum, el geneina, west darfur, darfur, africa",
          "author": "Paul Brian",
          "publication_date": null,
          "language": "en-US",
          "favicon_url": "https://static.religionunplugged.com/assets/favicon-32x32.png",
          "og_title": "Sudan Takes UAE to World Court Over Alleged Complicity in Genocide",
          "og_description": "Sudan has filed a case against the United Arab Emirates at the International Court of Justice, accusing the Gulf nation of supporting a paramilitary group that is accused of atrocities.",
          "og_image": "https://static.religionunplugged.com/uploads/large/dcee5a93-3473-462d-b218-064c6243c17f.jpeg",
          "og_url": "https://religionunplugged.com/news/2025/3/11/sudan-takes-uae-to-world-court-over-alleged-complicity-in-genocide",
          "og_type": "article",
          "headings": [
            "Sudan Takes UAE to World Court Over Alleged Complicity in Genocide",
            "A damaged vehicle sits on a street in Khartoum, Sudan, on May 21, 2023. Sudan has accused the United Arab Emirates of backing the paramilitary Rapid Support Forces (RSF), which is accused of atrocities during the ongoing civil war. (AP Photo/Marwan Ali)",
            "By Paul Brian March 11, 2025",
            "Sudan has filed a case against the United Arab Emirates at the International Court of Justice, accusing the Gulf nation of supporting a paramilitary group that is accused of atrocities.",
            "In its application to the ICJ, Sudan alleges that the UAE has violated international law by providing financial and military support to the Rapid Support Forces (RSF), a paramilitary group that has been fighting the Sudanese army since April 2023.",
            "The conflict between the Sudanese army and the RSF has resulted in a dire humanitarian crisis, with widespread reports of human rights abuses, including killings, rape and torture. The International Criminal Court has opened an investigation into alleged war crimes and crimes against humanity committed in Darfur.",
            "Sudan accuses the UAE of providing the RSF with weapons, training and financial assistance, which it says has enabled the paramilitary group to carry out its attacks. The Sudanese government has presented evidence to the ICJ, including documents and witness testimony, which it says proves the UAE’s involvement.",
            "“The UAE has violated its obligations under international law, including the Charter of the United Nations, the Genocide Convention and the International Covenant on Civil and Political Rights,” Sudan’s application to the ICJ states. “The UAE has provided support to the RSF, knowing that this support would be used to commit atrocities against the Sudanese people.”",
            "The UAE has denied the allegations, claiming that it is neutral in the conflict and that it is only providing humanitarian assistance to the Sudanese people. However, Sudan insists that the UAE’s support for the RSF is undeniable.",
            "“The evidence is clear,” said a spokesperson for the Sudanese government. “The UAE is supporting the RSF, and the RSF is committing atrocities against the Sudanese people. The UAE must be held accountable for its actions.”",
            "The ICJ is the principal judicial organ of the United Nations, and its rulings are binding on member states. However, the court has no power to enforce its decisions, and it is up to the UN Security Council to ensure that its rulings are implemented.",
            "The Sudanese government is hoping that the ICJ will order the UAE to stop supporting the RSF and to pay reparations to the victims of the conflict. It is also hoping that the ICJ’s ruling will put pressure on the international community to take action to end the conflict in Sudan.",
            "“We are confident that the ICJ will find in our favor,” said the Sudanese spokesperson. “The evidence is overwhelming, and the law is on our side. We are determined to hold the UAE accountable for its actions, and we will not rest until justice is done.”",
            "Edited by",
            "Richard Ostling",
            "Richard Ostling is a veteran religion reporter and founder of Religion Unplugged."
          ],
          "domain_name": "religionunplugged.com"
        }
      },
      {
        "6": {
          "url": "https://globalvoices.org/2025/03/15/another-test-for-international-justice-sudan-takes-the-uae-to-the-icj-over-its-complicity-in-genocide/",
          "title": "Another test for international justice: Sudan takes the UAE to the ICJ over its complicity in genocide",
          "description": "As the conflict in Sudan escalates, the country's government has filed a case before the International Court of Justice accusing the United Arab Emirates of supporting the Rapid Support Forces.",
          "keywords": "International law,Sudan,United Arab Emirates",
          "author": "Joey Ayoub",
          "publication_date": null,
          "language": "en",
          "favicon_url": "https://globalvoices.org/wp-content/uploads/2016/07/cropped-gv-logo-32x32.png",
          "og_title": "Another test for international justice: Sudan takes the UAE to the ICJ over its complicity in genocide",
          "og_description": "As the conflict in Sudan escalates, the country's government has filed a case before the International Court of Justice accusing the United Arab Emirates of supporting the Rapid Support Forces.",
          "og_image": "https://globalvoices.org/wp-content/uploads/2024/03/Sudan-ICJ-GV-1.jpg",
          "og_url": "https://globalvoices.org/2025/03/15/another-test-for-international-justice-sudan-takes-the-uae-to-the-icj-over-its-complicity-in-genocide/",
          "og_type": "article",
          "headings": [
            "Another test for international justice: Sudan takes the UAE to the ICJ over its complicity in genocide",
            "Translation posted 19 March 2025",
            "A soldier of the Sudanese army stands guard at a check point in Khartoum, Sudan, on October 1, 2024. Source: AFP, used with permission.",
            "As the conflict in Sudan escalates, the country's government has filed a case before the International Court of Justice accusing the United Arab Emirates of supporting the Rapid Support Forces.",
            "This article is based on content written by Joey Ayoub and published on Global Voices in Arabic. An edited version is published below as part of a content-sharing agreement.",
            "On March 6, Sudan filed a case before the International Court of Justice (ICJ) accusing the United Arab Emirates (UAE) of supporting the Rapid Support Forces (RSF). For almost a year, the RSF have been battling the Sudanese Armed Forces (SAF) for control of the country. Tens of thousands of people have been killed and over 8 million have been displaced in what is already a catastrophic situation for the country and the region.",
            "In its application [pdf] to the ICJ, Sudan stated that it seeks “to obtain redress for the UAE’s violations of Sudan’s sovereignty, its interference in Sudan’s internal affairs, and its use of force against the Sudanese people.”",
            "The UAE has been a key backer of Sudan’s military, especially since the 2019 overthrow of Omar al-Bashir. However, since the start of the conflict, it has been accused of supporting the RSF with weapons and other resources. The UAE has denied these accusations.",
            "The ICJ is the principal judicial organ of the United Nations. It was established in 1945 and is based in The Hague, Netherlands. The ICJ’s role is to settle, in accordance with international law, legal disputes submitted to it by States and to give advisory opinions on legal questions referred to it by authorized United Nations organs and specialized agencies.",
            "The ICJ’s jurisdiction is based on the consent of states. This means that a state can only be brought before the ICJ if it has consented to the court’s jurisdiction. States can consent to the ICJ’s jurisdiction in a number of ways, including by signing a treaty that gives the ICJ jurisdiction over disputes arising under the treaty.",
            "In this particular case, Sudan is arguing that the UAE has violated a number of international treaties, including the UN Charter, the Genocide Convention, and the International Covenant on Civil and Political Rights. Sudan argues that these treaties give the ICJ jurisdiction over the dispute.",
            "It is important to note that the ICJ’s decisions are binding on states. However, the ICJ has no power to enforce its decisions. If a state fails to comply with an ICJ decision, the other party to the dispute can bring the matter before the UN Security Council, which can then take measures to enforce the decision.",
            "While it is difficult to predict the outcome of this case, it is clear that it is a major test for international justice. If the ICJ finds that the UAE has violated international law, it would send a strong message that states cannot act with impunity. It would also provide a measure of justice for the victims of the conflict in Sudan.",
            "Written by",
            "Joey Ayoub",
            "Joey Ayoub is an opinion editor at Global Voices. "
          ],
          "domain_name": "globalvoices.org"
        }
      },
      {
        "7": {
          "url": "https://edition.cnn.com/2025/03/07/middleeast/sudan-uae-icj-intl-latam/index.html",
          "title": "Sudan files case against UAE at International Court of Justice, accusing it of supporting rival forces",
          "description": "Sudan has filed a case against the United Arab Emirates at the International Court of Justice, accusing it of supporting the rival Rapid Support Forces (RSF) battling Sudan’s army, Sudan’s foreign ministry said in a statement Wednesday.",
          "keywords": null,
          "author": null,
          "publication_date": null,
          "language": "en-US",
          "favicon_url": "https://www.cnn.com/favicon.ico",
          "og_title": "Sudan files case against UAE at International Court of Justice, accusing it of supporting rival forces",
          "og_description": "Sudan has filed a case against the United Arab Emirates at the International Court of Justice, accusing it of supporting the rival Rapid Support Forces (RSF) battling Sudan’s army, Sudan’s foreign ministry said in a statement Wednesday.",
          "og_image": "https://media.cnn.com/api/v1/images/stellar/prod/240306142449-01-sudan-fighting-030624.jpg?c=16x9&q=w_800,c_fill",
          "og_url": "https://edition.cnn.com/2025/03/07/middleeast/sudan-uae-icj-intl-latam/index.html",
          "og_type": "article",
          "headings": [
            "Sudan files case against UAE at International Court of Justice, accusing it of supporting rival forces",
            "By Nadeen Ebrahim, CNN",
            "Wed March 6, 2024",
            "A Sudanese demonstrator shouts slogans during a protest against the ongoing conflict between the Sudanese army and the paramilitary Rapid Support Forces (RSF) in Khartoum, Sudan, on Wednesday, March 6, 2024.",
            "Sudan has filed a case against the United Arab Emirates at the International Court of Justice, accusing it of supporting the rival Rapid Support Forces (RSF) battling Sudan’s army, Sudan’s foreign ministry said in a statement Wednesday.",
            "The ministry said it presented evidence that the UAE provided weapons, financial and political support to the RSF, accusing the Gulf state of fueling the conflict and causing widespread destruction and human rights abuses.",
            "The UAE has not yet officially responded to the accusations. It has previously denied providing military support to any of the warring parties in Sudan.",
            "The ICJ, also known as the World Court, is the United Nations’ highest court for disputes between states. Its rulings are binding but difficult to enforce.",
            "The conflict in Sudan erupted in April 2024, after months of escalating tensions between the army and the RSF. The fighting has killed thousands of people and displaced millions more.",
            "CNN’s Nimi Elbagir contributed to this report."
          ],
          "domain_name": "edition.cnn.com"
        }
      },
      {
        "8": {
          "url": "https://apnews.com/article/sudan-war-icj-uae-8b27cb3b8e4fef5b05a6b45084c967c7",
          "title": "Sudan accuses UAE of supporting rival forces in its civil war and files case at world court",
          "description": "Sudan has filed a case at the International Court of Justice accusing the United Arab Emirates of supporting a rival paramilitary group in its civil war. The conflict has killed thousands and displaced millions.",
          "keywords": "United Arab Emirates, Middle East, Africa, Sudan, War and conflict, International Court of Justice, United Nations, Paramilitary groups, Rapid Support Forces",
          "author": null,
          "publication_date": null,
          "language": "en",
          "favicon_url": "https://apnews.com/assets/static_assets/favicons/apnews.ico",
          "og_title": "Sudan accuses UAE of supporting rival forces in its civil war and files case at world court",
          "og_description": "Sudan has filed a case at the International Court of Justice accusing the United Arab Emirates of supporting a rival paramilitary group in its civil war. The conflict has killed thousands and displaced millions.",
          "og_image": "https://storage.googleapis.com/afs-prod/media/84c3336932ca4169b0a259f34800e738/1024.webp",
          "og_url": "https://apnews.com/article/sudan-war-icj-uae-8b27cb3b8e4fef5b05a6b45084c967c7",
          "og_type": "article",
          "headings": [
            "Top Stories",
            "International",
            "Sudan accuses UAE of supporting rival forces in its civil war and files case at world court",
            "By NOHA ELHENNAWY",
            "ASSOCIATED PRESS",
            "March 6, 2025",
            "FILE - Smoke rises in Khartoum, Sudan, May 21, 2023. Sudan’s foreign ministry said Wednesday, March 6, 2025, that the country has filed a case at the International Court of Justice accusing the United Arab Emirates of supporting the rival Rapid Support Forces battling Sudan’s army. (AP Photo/Marwan Ali, File)",
            "CAIRO — Sudan has filed a case at the International Court of Justice accusing the United Arab Emirates of supporting a rival paramilitary group in its civil war, the country’s Foreign Ministry said Wednesday.",
            "The ministry said it has presented evidence that the UAE provided weapons, financial and political support to the Rapid Support Forces, which has been battling the Sudanese army since April 2023. It said the UAE’s support fueled the conflict and caused widespread destruction and human rights abuses.",
            "There was no immediate comment from the UAE. However, Emirati officials have previously denied providing military support to any of the warring parties.",
            "The ICJ, which is also known as the World Court, is the United Nations’ highest court for disputes between states. Its rulings are binding but difficult to enforce.",
            "Sudan has been rocked by violence since mid-April 2023, when months of simmering tensions between the military and the RSF exploded into open fighting. The conflict has killed more than 13,000 people, according to the Armed Conflict Location & Event Data Project, which tracks violence around the world. However, casualty figures are likely much higher, according to U.N. officials.",
            "The fighting has also displaced more than 8 million people, turning Sudan into the world’s largest displacement crisis. The U.N. has warned that the conflict could plunge the country into a catastrophic hunger crisis.",
            "Noha Elhennawy, The Associated Press"
          ],
          "domain_name": "apnews.com"
        }
      },
      {
        "9": {
          "url": "https://www.middleeasteye.net/news/sudan-launches-case-against-uae-icj-over-complicity-genocide",
          "title": "Sudan launches case against UAE at ICJ over 'complicity in genocide'",
          "description": "Khartoum accuses Abu Dhabi of supporting the Rapid Support Forces in the year-long civil war that has devastated the country",
          "keywords": [
            "Sudan",
            "UAE",
            "ICJ",
            "Rapid Support Forces",
            "Sudan conflict"
          ],
          "author": "MEE staff",
          "publication_date": null,
          "language": "en",
          "favicon_url": "https://www.middleeasteye.net/sites/all/themes/mme/images/favicon.ico",
          "og_title": "Sudan launches case against UAE at ICJ over 'complicity in genocide'",
          "og_description": "Khartoum accuses Abu Dhabi of supporting the Rapid Support Forces in the year-long civil war that has devastated the country",
          "og_image": "https://www.middleeasteye.net/sites/default/files/styles/mee_image_1200x630/public/images/2024-03/AFP_AFP_349D8UU.jpg?itok=iXVj-V-K",
          "og_url": "https://www.middleeasteye.net/news/sudan-launches-case-against-uae-icj-over-complicity-genocide",
          "og_type": "article",
          "headings": [
            "Sudan launches case against UAE at ICJ over 'complicity in genocide'",
            "Khartoum accuses Abu Dhabi of supporting the Rapid Support Forces in the year-long civil war that has devastated the country",
            "MEE staff",
            "Published: 6 March 2025 18:04 GMT",
            "Smoke rises over Khartoum, Sudan, on 21 May 2023 (AFP)",
            "Sudan has launched a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing it of supporting the Rapid Support Forces (RSF) in the year-long civil war that has devastated the country.",
            "In its application to the ICJ, Sudan said it was seeking “to obtain redress for the UAE’s violations of Sudan’s sovereignty, its interference in Sudan’s internal affairs, and its use of force against the Sudanese people”.",
            "The Sudanese foreign ministry said it had presented evidence that the UAE provided weapons and financial and political support to the RSF.",
            "It added that the UAE’s actions had fuelled the conflict and caused widespread destruction and human rights abuses.",
            "The UAE has not yet officially responded to the accusations. However, it has previously denied providing military support to any of the warring parties in Sudan.",
            "The ICJ has the authority to issue binding rulings on disputes between states, but its decisions are not always enforced.",
            "The conflict in Sudan erupted in April 2024, after months of escalating tensions between the army and the RSF. The fighting has killed thousands of people and displaced millions more.",
            "In December, the US Treasury Department imposed sanctions on companies it said were financing the RSF and coordinating the procurement of weapons for the group. The Treasury said that some of these companies were based in the UAE.",
            "The UAE has been a major investor in Sudan in recent years and a key ally of the Sudanese military. Some analysts say that the UAE’s support for the RSF is aimed at undermining the Sudanese government and gaining influence in the country.",
            "Others say that the UAE is simply trying to protect its interests in Sudan and prevent the country from descending into further chaos.",
            "The Sudanese government has been under increasing pressure to end the conflict. In recent weeks, it has launched a new military offensive against the RSF and called on the international community to put pressure on the UAE to stop supporting the RSF.",
            "The ICJ is expected to hold hearings on the case in the coming months, and its ruling could have a significant impact on the conflict in Sudan."
          ],
          "domain_name": "www.middleeasteye.net"
        }
      },
      {
        "10": {
          "url": "https://www.asil.org/ILIB/sudan-institutes-proceedings-against-uae-icj",
          "title": "Sudan Institutes Proceedings Against United Arab Emirates Before International Court of Justice",
          "description": null,
          "keywords": null,
          "author": null,
          "publication_date": null,
          "language": null,
          "favicon_url": "https://www.asil.org/sites/all/themes/asil/favicon.ico",
          "og_title": "Sudan Institutes Proceedings Against United Arab Emirates Before International Court of Justice",
          "og_description": null,
          "og_image": null,
          "og_url": "https://www.asil.org/ILIB/sudan-institutes-proceedings-against-uae-icj",
          "og_type": "article",
          "headings": [
            "International Legal News & Commentary",
            "Sudan Institutes Proceedings Against United Arab Emirates Before International Court of Justice"
          ],
          "domain_name": "www.asil.org"
        }
      },
      {
        "11": {
          "url": "https://www.theafricareport.com/378537/explainer-why-sudan-is-taking-the-uae-to-international-court-of-justice/",
          "title": "Explainer: Why Sudan is taking the UAE to the International Court of Justice",
          "description": "Sudan has accused the United Arab Emirates of supporting the Rapid Support Forces (RSF) in its ongoing conflict with the Sudanese army. The move to the ICJ is a major escalation, but what does it mean?",
          "keywords": "Sudan, United Arab Emirates, ICJ, Rapid Support Forces, Conflict, International Court of Justice, Politics, Diplomacy",
          "author": "AFP",
          "publication_date": null,
          "language": "en-US",
          "favicon_url": "https://www.theafricareport.com/wp-content/themes/theafricareport-theme/assets/img/favicon/favicon-32x32.png",
          "og_title": "Explainer: Why Sudan is taking the UAE to the International Court of Justice",
          "og_description": "Sudan has accused the United Arab Emirates of supporting the Rapid Support Forces (RSF) in its ongoing conflict with the Sudanese army. The move to the ICJ is a major escalation, but what does it mean?",
          "og_image": "https://www.theafricareport.com/wp-content/uploads/2024/03/Sudan-ICJ.jpg",
          "og_url": "https://www.theafricareport.com/378537/explainer-why-sudan-is-taking-the-uae-to-international-court-of-justice/",
          "og_type": "article",
          "headings": [
            "The Africa Report",
            "Explainer: Why Sudan is taking the UAE to the International Court of Justice",
            "A Sudanese demonstrator shouts slogans during a protest against the ongoing conflict between the Sudanese army and the paramilitary Rapid Support Forces (RSF) in Khartoum, Sudan, on Wednesday, March 6, 2024. | AFP",
            "AFP",
            "Published: 7 March 2025",
            "Sudan has accused the United Arab Emirates of supporting the Rapid Support Forces (RSF) in its ongoing conflict with the Sudanese army. The move to the ICJ is a major escalation, but what does it mean?",
            "On March 6, 2025, Sudan’s foreign ministry announced that it had filed a case before the International Court of Justice (ICJ) against the United Arab Emirates (UAE).",
            "Khartoum accuses Abu Dhabi of supporting the Rapid Support Forces (RSF), the paramilitary group that has been battling the Sudanese army for almost a year.",
            "In its application to the ICJ, Sudan said it was seeking “to obtain redress for the UAE’s violations of Sudan’s sovereignty, its interference in Sudan’s internal affairs, and its use of force against the Sudanese people”.",
            "The Sudanese foreign ministry said it had presented evidence that the UAE provided weapons and financial and political support to the RSF, fuelling the conflict and causing widespread destruction and human rights abuses.",
            "The UAE has not yet officially responded to the accusations, but has previously denied providing military support to any of the warring parties in Sudan.",
            "The ICJ is the United Nations’ highest court for disputes between states. Its rulings are binding but difficult to enforce.",
            "The conflict in Sudan erupted in April 2024, after months of escalating tensions between the army and the RSF. The fighting has killed thousands of people and displaced millions more.",
            "Here’s what you need to know:",
            "What is the ICJ?",
            "Why is Sudan taking the UAE to the ICJ?",
            "What is the UAE accused of?",
            "What happens next?",
            "Bottom line"
          ],
          "domain_name": "www.theafricareport.com"
        }
      },
      {
        "12": {
          "url": "https://www.france24.com/en/live-news/20250308-what-is-the-uae-s-involvement-in-war-torn-sudan",
          "title": "What is the UAE's involvement in war-torn Sudan?",
          "description": "Sudan has accused the United Arab Emirates of backing a paramilitary group that is accused of atrocities. We take a look at the UAE's involvement in the conflict.",
          "keywords": "Sudan, UAE, Rapid Support Forces, RSF, Mohamed Hamdan Daglo, Hemedti, Burhan, army, conflict, war, ICJ, International Criminal Court, ICC, Darfur, genocide",
          "author": null,
          "publication_date": null,
          "language": "en",
          "favicon_url": "https://static.france24.com/meta_og_logo.png",
          "og_title": "What is the UAE's involvement in war-torn Sudan?",
          "og_description": "Sudan has accused the United Arab Emirates of backing a paramilitary group that is accused of atrocities. We take a look at the UAE's involvement in the conflict.",
          "og_image": "https://static.france24.com/meta_og_twcard/F24-social-share-EN.png",
          "og_url": "https://www.france24.com/en/live-news/20250308-what-is-the-uae-s-involvement-in-war-torn-sudan",
          "og_type": "article",
          "headings": [
            "Live News",
            "What is the UAE's involvement in war-torn Sudan?",
            "Text by:  France 24",
            "File photo of smoke billowing over Khartoum on May 16, 2023.",
            "Sudan has accused the United Arab Emirates of backing the Rapid Support Forces (RSF), a paramilitary group accused of atrocities in the country's ongoing conflict. The Sudanese government has filed a case with the International Court of Justice (ICJ) accusing the UAE of funding the RSF.",
            "The UAE denies the charges, but what exactly is its involvement in Sudan?",
            "Since fighting broke out in April 2024 between the Sudanese army and the RSF, the UAE has officially maintained a neutral stance, calling for a peaceful resolution to the conflict. However, several reports and investigations have suggested that the UAE has been providing support to the RSF, which is led by Mohamed Hamdan Daglo, also known as Hemedti.",
            "The UAE has strong economic and political ties to Sudan, and has invested heavily in the country in recent years. It has also been a key ally of the Sudanese military, which is led by General Abdel Fattah al-Burhan.",
            "Some analysts say that the UAE's support for the RSF is aimed at undermining the Sudanese government and gaining influence in the country. Others say that the UAE is simply trying to protect its interests in Sudan and prevent the country from descending into further chaos.",
            "The UAE's alleged support for the RSF has drawn criticism from human rights groups and international organizations. They accuse the UAE of fueling the conflict and contributing to the suffering of the Sudanese people.",
            "The International Criminal Court (ICC) is also investigating alleged war crimes and crimes against humanity committed in Sudan, including those allegedly committed by the RSF.",
            "The UAE has not commented on the ICC investigation, but it has previously denied any involvement in war crimes or crimes against humanity.",
            "As the conflict in Sudan continues, the UAE's role in the country is likely to come under increasing scrutiny. The ICJ case filed by the Sudanese government could shed further light on the UAE's involvement and potentially lead to further action by the international community."
          ],
          "domain_name": "www.france24.com"
        }
      },
      {
        "13": {
          "url": "https://insights.doughtystreet.co.uk/post/102k4a2/the-genocide-convention-before-the-world-court-again",
          "title": "The Genocide Convention before the World Court again",
          "description": "Dr Wayne Jordash KC and David Akinnibosun examine the new case brought by Sudan against the UAE before the International Court of Justice.",
          "keywords": null,
          "author": null,
          "publication_date": null,
          "language": "en",
          "favicon_url": "https://insights.doughtystreet.co.uk/assets/favicon-32x32-e4627543b559ca03e66687974968c97b7452a16ea72e5310f9905b76d17784ca.png",
          "og_title": "The Genocide Convention before the World Court again",
          "og_description": "Dr Wayne Jordash KC and David Akinnibosun examine the new case brought by Sudan against the UAE before the International Court of Justice.",
          "og_image": "https://insights.doughtystreet.co.uk/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBeW9EQVE9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--423191324a9fd9c193963895a094c808c562827c/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCam9VWkhNNkJrVlVPZ052YlY4d2JHRjVlR1Z6QmtWVSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--ca45232924042238241874a5465a0954a9c94239/ICJ%20judges.jpg",
          "og_url": "https://insights.doughtystreet.co.uk/post/102k4a2/the-genocide-convention-before-the-world-court-again",
          "og_type": "article",
          "headings": [
            "Insights",
            "The Genocide Convention before the World Court again",
            "Dr Wayne Jordash KC and David Akinnibosun examine the new case brought by Sudan against the UAE before the International Court of Justice.",
            "Wayne Jordash KC",
            "David Akinnibosun",
            "6 March 2025",
            "On 6 March 2025, Sudan instituted proceedings against the United Arab Emirates (UAE) before the International Court of Justice (ICJ). The application concerns alleged violations of the 1948 Convention on the Prevention and Punishment of the Crime of Genocide (Genocide Convention) arising out of the ongoing conflict in Sudan.",
            "Sudan claims that the UAE has supported the Rapid Support Forces (RSF) in its fight against the Sudanese Armed Forces (SAF). Sudan argues that the UAE’s support for the RSF constitutes a violation of the Genocide Convention because the RSF has allegedly committed acts of genocide against certain groups in Sudan, including the Masalit community in West Darfur.",
            "The case is significant for several reasons. First, it is one of the few cases in which a state has accused another state of violating the Genocide Convention. Second, it is the first case in which the ICJ will have to consider the question of whether support for a non-state actor can constitute a violation of the Genocide Convention. Third, the case is likely to have a significant impact on the conflict in Sudan. If the ICJ finds that the UAE has violated the Genocide Convention, it could lead to increased international pressure on the UAE to end its support for the RSF.",
            "The ICJ has previously considered the Genocide Convention in a number of cases, including Bosnia v Serbia. In that case, the ICJ found that Serbia had violated the Genocide Convention by failing to prevent the genocide in Srebrenica. The ICJ also found that Serbia was responsible for failing to punish the perpetrators of the genocide.",
            "The case of Sudan v UAE is likely to be a complex and lengthy one. The ICJ will have to consider a number of difficult legal and factual issues. It is likely to be several years before the ICJ reaches a decision in the case.",
            "Dr Wayne Jordash KC is a barrister at Doughty Street Chambers. He specialises in international criminal law, human rights law and public international law.",
            "David Akinnibosun is a barrister at Doughty Street Chambers. He specialises in international criminal law, human rights law and public international law."
          ],
          "domain_name": "insights.doughtystreet.co.uk"
        }
      },
      {
        "14": {
          "url": "https://www.forbes.com/sites/ewelinaochab/2025/03/09/sudan-takes-uae-to-world-court-over-alleged-complicity-in-genocide/",
          "title": "Sudan Takes UAE To World Court Over Alleged Complicity In Genocide",
          "description": "Sudan has filed a case before the International Court of Justice (ICJ) accusing the United Arab Emirates (UAE) of supporting the Rapid Support Forces (RSF) and of being complicit in the crime of genocide.",
          "keywords": null,
          "author": "Ewelina U. Ochab",
          "publication_date": null,
          "language": "en-US",
          "favicon_url": "https://i.forbesimg.com/favicon.ico",
          "og_title": "Sudan Takes UAE To World Court Over Alleged Complicity In Genocide",
          "og_description": "Sudan has filed a case before the International Court of Justice (ICJ) accusing the United Arab Emirates (UAE) of supporting the Rapid Support Forces (RSF) and of being complicit in the crime of genocide.",
          "og_image": "https://imageio.forbes.com/specials-images/imageserve/65eef7e53aa44669980d5efb/0x0.jpg?format=jpg&width=1200",
          "og_url": "https://www.forbes.com/sites/ewelinaochab/2025/03/09/sudan-takes-uae-to-world-court-over-alleged-complicity-in-genocide/",
          "og_type": "article",
          "headings": [
            "Ewelina U. Ochab",
            "Senior Contributor",
            "Human Rights",
            "Following",
            "Sudan Takes UAE To World Court Over Alleged Complicity In Genocide",
            "A general view shows smoke rising in Khartoum, Sudan on May 20, 2023, amid fighting between the army and the paramilitary Rapid Support Forces (RSF).",
            "AFP via Getty Images",
            "Sudan has filed a case before the International Court of Justice (ICJ) accusing the United Arab Emirates (UAE) of supporting the Rapid Support Forces (RSF) and of being complicit in the crime of genocide.",
            "In its Application instituting proceedings before the ICJ, Sudan stated that it “seeks to obtain redress for the UAE’s violations of Sudan’s sovereignty, its interference in Sudan’s internal affairs, and its use of force against the Sudanese people.”",
            "The Application also stated that  “[t]hrough its actions, the UAE has prolonged and intensified the conflict, resulting in the widespread destruction of infrastructure, countless civilian casualties, and a grave humanitarian crisis.”",
            "The UAE has been allegedly supporting the RSF in the conflict against the Sudanese army. The conflict has been ongoing since April 2023. As reported by the UN,  both the Sudanese army and the RSF have committed war crimes. Allegations of genocide have also emerged.",
            "As I explained earlier this week, the situation in Sudan is dire, and the international community is failing the people of Sudan. There has been a communications blackout, and the humanitarian access has been limited. The UN estimates that  25 million people need humanitarian assistance and protection. The violence has already displaced over 8 million people.",
            "The current ICJ case is not the first case relating to the crime of genocide that is before the ICJ.  South Africa instituted proceedings against Israel concerning alleged violations of obligations under the Genocide Convention in relation to the situation in the Gaza Strip. As I  argued elsewhere, the ICJ’s Order on provisional measures in that case has been disappointing.",
            "It is  important to note that the ICJ’s judgments are binding. However, the ICJ has no power to enforce its judgments. If a State fails to comply with a judgment of the ICJ, the other party to the case may bring the matter before the UN Security Council, which may make recommendations or decide upon measures to be taken to give effect to the judgment.",
            "It remains to be seen what the ICJ will decide in the case of Sudan v. UAE. However, the case is significant as it highlights the importance of the Genocide Convention and the role of the ICJ in preventing and punishing the crime of genocide.",
            "Follow me on Twitter or LinkedIn. Check out my website.",
            "Ewelina U. Ochab",
            "I am a human rights advocate, author and co-founder of the Coalition for Genocide Response. I have worked on a number of country-specific and thematic human rights issues at the UN Human Rights Council in Geneva, as well as on the...",
            "Read More"
          ],
          "domain_name": "www.forbes.com"
        }
      },
      {
        "15": {
          "url": "https://www.nytimes.com/2025/03/06/world/africa/sudan-genocide-icj-uae.html",
          "title": "Sudan Accuses U.A.E. of Fueling Genocide in Lawsuit at World Court",
          "description": "The complaint accuses the United Arab Emirates of supporting a paramilitary group that has been accused of atrocities in Sudan’s civil war.",
          "keywords": "Sudan, United Arab Emirates, War Crimes, Genocide, International Court of Justice",
          "author": "Declan Walsh",
          "publication_date": null,
          "language": "en-US",
          "favicon_url": "https://static01.nyt.com/favicon.ico",
          "og_title": "Sudan Accuses U.A.E. of Fueling Genocide in Lawsuit at World Court",
          "og_description": "The complaint accuses the United Arab Emirates of supporting a paramilitary group that has been accused of atrocities in Sudan’s civil war.",
          "og_image": "https://static01.nyt.com/images/2024/03/06/multimedia/06sudan-01-pvbq/06sudan-01-pvbq-facebookJumbo.jpg",
          "og_url": "https://www.nytimes.com/2025/03/06/world/africa/sudan-genocide-icj-uae.html",
          "og_type": "article",
          "headings": [
            "World",
            "Africa",
            "Sudan Accuses U.A.E. of Fueling Genocide in Lawsuit at World Court",
            "The complaint accuses the United Arab Emirates of supporting a paramilitary group that has been accused of atrocities in Sudan’s civil war.",
            "By Declan Walsh",
            "March 6, 2025",
            "Smoke rising over Khartoum in May. Sudan’s civil war, which began last year, has caused a humanitarian disaster.",
            "Sudan has filed a lawsuit at the International Court of Justice accusing the United Arab Emirates of fueling genocide by supporting a paramilitary group that has been accused of atrocities in Sudan’s civil war.",
            "The complaint, filed on Wednesday at the court in The Hague, accuses the U.A.E. of violating international law by providing financial and military support to the Rapid Support Forces, or R.S.F., a militia that has been battling the Sudanese Army for control of the country since April.",
            "The lawsuit marks a sharp escalation of the conflict, which has already caused a humanitarian disaster, displacing more than eight million people and leaving Sudan on the brink of famine.",
            "It also opens a new front in the diplomatic war surrounding the conflict, which pits Sudan’s military rulers against the U.A.E., a wealthy Gulf state that has emerged as a major player in the region.",
            "In its lawsuit, Sudan says the U.A.E. has provided the R.S.F. with weapons, training and financial assistance, knowing that this support would be used to commit atrocities against the Sudanese people.",
            "“The U.A.E. has violated its obligations under international law, including the Charter of the United Nations, the Genocide Convention and the International Covenant on Civil and Political Rights,” the lawsuit says.",
            "The U.A.E. has denied the allegations, calling them “baseless and without merit.” In a statement, the U.A.E.’s Ministry of Foreign Affairs said that it “remains committed to supporting a peaceful resolution to the conflict in Sudan” and that it “has never provided military support to any party in the conflict.”",
            "However, the U.A.E.’s denials have been met with skepticism by many observers, who point to the country’s close ties to the R.S.F. and its leader, Gen. Mohamed Hamdan Dagalo, also known as Hemedti.",
            "The U.A.E. has been a major investor in Sudan in recent years, and has also provided the country with significant financial assistance. In 2019, the U.A.E. pledged $3 billion in aid to Sudan, and in 2020, it provided the country with a $1.5 billion loan.",
            "Some analysts say that the U.A.E.’s support for the R.S.F. is aimed at undermining the Sudanese government and gaining influence in the country. Others say that the U.A.E. is simply trying to protect its interests in Sudan and prevent the country from descending into further chaos.",
            "Whatever the U.A.E.’s motives, its support for the R.S.F. has had a devastating impact on Sudan, contributing to the deaths of thousands of people and the displacement of millions more.",
            "The International Court of Justice is the principal judicial organ of the United Nations. It has the authority to hear disputes between states, and its rulings are binding.",
            "However, the court has no power to enforce its rulings, and its decisions are often ignored by states that do not agree with them.",
            "It is unclear whether the International Court of Justice will be able to resolve the conflict in Sudan. But the lawsuit filed by Sudan is a sign that the country is determined to hold the U.A.E. accountable for its actions.",
            "Declan Walsh is the chief Africa correspondent. He has reported from across the continent since 2013. Before that, he covered Pakistan, Afghanistan and Iraq.  More about Declan Walsh"
          ],
          "domain_name": "www.nytimes.com"
        }
      },
      {
        "16": {
          "url": "https://www.genocidewatch.com/single-post/sudan-files-genocide-case-against-uae-at-icj",
          "title": "Sudan files genocide case against UAE at ICJ - Genocide Watch",
          "description": "Sudan has filed a case before the International Court of Justice (ICJ) against the United Arab Emirates (UAE) for allegedly supporting the Rapid Support Forces (RSF).",
          "keywords": null,
          "author": null,
          "publication_date": null,
          "language": "en",
          "favicon_url": "https://static.wixstatic.com/media/846982_c44b7941534942b1a5c7833f8f294c8e%7Emv2.png/v1/fill/w_32%2Ch_32%2Cal_c%2Cusm_0.66_1.00_0.01/846982_c44b7941534942b1a5c7833f8f294c8e%7Emv2.png",
          "og_title": "Sudan files genocide case against UAE at ICJ - Genocide Watch",
          "og_description": "Sudan has filed a case before the International Court of Justice (ICJ) against the United Arab Emirates (UAE) for allegedly supporting the Rapid Support Forces (RSF).",
          "og_image": "https://static.wixstatic.com/media/846982_f4829a8917194a588020e9247c470594%7Emv2.jpg/v1/fill/w_1200,h_630,al_c,q_85,usm_0.66_1.00_0.01/846982_f4829a8917194a588020e9247c470594%7Emv2.jpg",
          "og_url": "https://www.genocidewatch.com/single-post/sudan-files-genocide-case-against-uae-at-icj",
          "og_type": "article",
          "headings": [
            "Sudan files genocide case against UAE at ICJ",
            "Sudan has filed a case before the International Court of Justice (ICJ) against the United Arab Emirates (UAE) for allegedly supporting the Rapid Support Forces (RSF). The RSF is a paramilitary group that has been accused of committing atrocities in Sudan, including acts of genocide.",
            "In its application to the ICJ, Sudan stated that the UAE has violated its obligations under the Genocide Convention by providing support to the RSF, knowing that the RSF would use that support to commit genocide. Sudan is seeking a ruling from the ICJ that the UAE is in violation of the Genocide Convention and that the UAE must cease its support for the RSF.",
            "The ICJ is the principal judicial organ of the United Nations. It is responsible for settling disputes between states in accordance with international law. The ICJ's judgments are binding on the parties to a dispute, but the ICJ has no power to enforce its judgments.",
            "The case of Sudan v. UAE is likely to be a lengthy and complex one. It is not clear when the ICJ will issue a ruling in the case.",
            "Genocide Watch considers the situation in Sudan to be a serious one. We call on the international community to take action to prevent further atrocities from being committed."
          ],
          "domain_name": "www.genocidewatch.com"
        }
      },
      {
        "17": {
          "url": "https://www.aa.com.tr/en/africa/sudan-takes-united-arab-emirates-to-icj-for-genocide-support-in-war-torn-country/3502216",
          "title": "Sudan takes United Arab Emirates to ICJ for 'genocide support' in war-torn country",
          "description": "Sudan accuses UAE of supporting paramilitary group in its conflict with army",
          "keywords": "sudan, united arab emirates, icj, genocide, rapid support forces, rsf, sudan conflict, africa",
          "author": "Aisha Muhammed",
          "publication_date": "2025-03-07T14:59:18+00:00",
          "language": "en",
          "favicon_url": "https://www.aa.com.tr/assets/images/favicon.ico",
          "og_title": "Sudan takes United Arab Emirates to ICJ for 'genocide support' in war-torn country",
          "og_description": "Sudan accuses UAE of supporting paramilitary group in its conflict with army",
          "og_image": "https://cdnuploads.aa.com.tr/uploads/Contents/2024/03/07/thumbs_b_c_a2f4d5c84d5b2fe79183a0f10298a11c.jpg",
          "og_url": "https://www.aa.com.tr/en/africa/sudan-takes-united-arab-emirates-to-icj-for-genocide-support-in-war-torn-country/3502216",
          "og_type": "article",
          "headings": [
            "Africa",
            "Sudan takes United Arab Emirates to ICJ for 'genocide support' in war-torn country",
            "Sudan accuses UAE of supporting paramilitary group in its conflict with army",
            "Aisha Muhammed",
            "07.03.2025",
            "Sudanese army soldiers stand guard in Khartoum, Sudan, on October 1, 2024. (AFP File Photo)",
            "KHARTOUM, Sudan (AA) - Sudan has filed a case before the International Court of Justice (ICJ) against the United Arab Emirates (UAE) for allegedly supporting the Rapid Support Forces (RSF).",
            "Sudan’s Foreign Ministry said in a statement on Wednesday that it has presented evidence that the UAE provided weapons, financial and political support to the RSF.",
            "“The UAE’s actions have fueled the conflict and caused widespread destruction and human rights abuses,” the ministry said.",
            "The UAE has yet to officially respond to the accusations. However, it has previously denied providing military support to any of the warring parties in Sudan.",
            "The ICJ, also known as the World Court, is the UN’s highest court for disputes between states. Its rulings are binding, but difficult to enforce.",
            "Sudan has been ravaged by a conflict between the army and the RSF since April 2024. More than 13,000 people have been killed and millions others displaced, according to UN figures."
          ],
          "domain_name": "www.aa.com.tr"
        }
      },
      {
        "18": {
          "url": "https://www.semafor.com/article/03/07/2025/sudan-launches-case-against-uae-at-the-international-court-of-justice",
          "title": "Sudan launches case against UAE at the International Court of Justice",
          "description": "The Sudanese government accused the U.A.E. of supporting a rival paramilitary group in the country’s civil war.",
          "keywords": null,
          "author": "Nicolas Niarchos",
          "publication_date": null,
          "language": "en",
          "favicon_url": "https://www.semafor.com/static/img/favicon/favicon-32x32.png",
          "og_title": "Sudan launches case against UAE at the International Court of Justice",
          "og_description": "The Sudanese government accused the U.A.E. of supporting a rival paramilitary group in the country’s civil war.",
          "og_image": "https://www.semafor.com/static/img/fallback.jpg",
          "og_url": "https://www.semafor.com/article/03/07/2025/sudan-launches-case-against-uae-at-the-international-court-of-justice",
          "og_type": "article",
          "headings": [
            "Sudan launches case against UAE at the International Court of Justice",
            "The Sudanese government accused the U.A.E. of supporting a rival paramilitary group in the country’s civil war.",
            "By  Nicolas Niarchos",
            "March 7, 2025 at 8:41 AM EST",
            "Sudan has filed a case at the International Court of Justice accusing the United Arab Emirates of supporting a rival paramilitary group in its civil war, the country’s Foreign Ministry said Wednesday.",
            "The ministry said it has presented evidence that the U.A.E. provided weapons, financial and political support to the Rapid Support Forces, which has been battling the Sudanese army since April 2024. It said the U.A.E.’s support fueled the conflict and caused widespread destruction and human rights abuses.",
            "There was no immediate comment from the U.A.E.. However, Emirati officials have previously denied providing military support to any of the warring parties.",
            "The ICJ, which is also known as the World Court, is the United Nations’ highest court for disputes between states. Its rulings are binding but difficult to enforce.",
            "Sudan has been rocked by violence since mid-April 2024, when months of simmering tensions between the military and the RSF exploded into open fighting. The conflict has killed more than 13,000 people, according to the Armed Conflict Location & Event Data Project, which tracks violence around the world. However, casualty figures are likely much higher, according to U.N. officials.",
            "The fighting has also displaced more than 8 million people, turning Sudan into the world’s largest displacement crisis. The U.N. has warned that the conflict could plunge the country into a catastrophic hunger crisis."
          ],
          "domain_name": "www.semafor.com"
        }
      },
      {
        "19": {
          "url": "https://www.jurist.org/news/2025/03/sudan-sues-uae-for-complicit-in-rsf-genocide-in-west-darfur/",
          "title": "Sudan sues UAE for complicit in RSF genocide in West Darfur",
          "description": "Sudan has filed a case before the International Court of Justice (ICJ) against the United Arab Emirates (UAE) for allegedly supporting the Rapid Support Forces (RSF) and aiding their commission of genocide.",
          "keywords": null,
          "author": "JURIST Staff",
          "publication_date": "2025-03-08T00:38:00-05:00",
          "language": "en-US",
          "favicon_url": "https://www.jurist.org/wp-content/uploads/2019/07/jurist-logo-icon.png",
          "og_title": "Sudan sues UAE for complicit in RSF genocide in West Darfur",
          "og_description": "Sudan has filed a case before the International Court of Justice (ICJ) against the United Arab Emirates (UAE) for allegedly supporting the Rapid Support Forces (RSF) and aiding their commission of genocide.",
          "og_image": "https://www.jurist.org/wp-content/uploads/2025/03/sudan_1709898724.jpg",
          "og_url": "https://www.jurist.org/news/2025/03/sudan-sues-uae-for-complicit-in-rsf-genocide-in-west-darfur/",
          "og_type": "article",
          "headings": [
            "Sudan sues UAE for complicit in RSF genocide in West Darfur",
            "Posted By: JURIST Staff",
            "Saturday, March 8, 2025 12:38:00 AM",
            "Smoke rises over Khartoum, Sudan, on May 21, 2023 amid fighting between the army and the paramilitary Rapid Support Forces (RSF). (AFP via Getty Images)",
            "Sudan has filed a case before the International Court of Justice (ICJ) against the United Arab Emirates (UAE) for allegedly supporting the Rapid Support Forces (RSF) and aiding their commission of genocide, Sudan’s Ministry of Foreign Affairs announced Wednesday.",
            "The Ministry stated that the UAE has violated Sudan’s sovereignty and interfered in its internal affairs through its support of the RSF. They also claim that the UAE has prolonged and intensified the conflict, leading to extensive destruction of infrastructure, numerous civilian casualties, and a severe humanitarian crisis.",
            "In their application to the ICJ, Sudan seeks redress for the UAE’s actions and asserts that the UAE has breached its obligations under international law, including the UN Charter, the Genocide Convention, and the International Covenant on Civil and Political Rights.",
            "The UAE has not yet responded to the lawsuit. However, they have previously denied providing military support to the RSF and have maintained that they are committed to finding a peaceful resolution to the conflict.",
            "The conflict in Sudan began in April 2023 between the Sudanese army and the RSF. The conflict has caused a major humanitarian crisis, with millions of people displaced and in need of assistance. The UN has warned that the conflict could lead to a full-blown civil war.",
            "JURIST Deputy News Editor Cooper French contributed to this report."
          ],
          "domain_name": "www.jurist.org"
        }
      },
      {
        "20": {
          "url": "https://www.africa-confidential.com/article/id/15391/burhan-takes-abu-dhabi-to-international-court-of-justice-on-genocide-charges",
          "title": "Burhan takes Abu Dhabi to International Court of Justice on genocide charges",
          "description": "General Abdel Fattah al Burhan's government accuses the United Arab Emirates of funding the Rapid Support Forces' campaign in Darfur",
          "keywords": null,
          "author": null,
          "publication_date": null,
          "language": null,
          "favicon_url": "https://www.africa-confidential.com/Themes/Custom/images/favicon.ico",
          "og_title": "Burhan takes Abu Dhabi to International Court of Justice on genocide charges",
          "og_description": "General Abdel Fattah al Burhan's government accuses the United Arab Emirates of funding the Rapid Support Forces' campaign in Darfur",
          "og_image": "https://www.africa-confidential.com/Images/Article/AC15391_Social.jpg",
          "og_url": "https://www.africa-confidential.com/article/id/15391/burhan-takes-abu-dhabi-to-international-court-of-justice-on-genocide-charges",
          "og_type": "article",
          "headings": [
            "Burhan takes Abu Dhabi to International Court of Justice on genocide charges",
            "General Abdel Fattah al Burhan's government accuses the United Arab Emirates of funding the Rapid Support Forces' campaign in Darfur",
            "06th March 2025"
          ],
          "domain_name": "www.africa-confidential.com"
        }
      },
      {
        "21": {
          "url": "https://www.voaafrica.com/a/sudan-defends-taking-uae-to-icj-for-allegedly-arming-rsf/8002061.html",
          "title": "Sudan Defends Taking UAE to ICJ for Allegedly Arming RSF",
          "description": "KHARTOUM — Sudan is defending its decision to file a case before the International Court of Justice accusing the United Arab Emirates of providing weapons and other support to the Rapid Support Forces battling Sudan’s army.",
          "keywords": null,
          "author": null,
          "publication_date": null,
          "language": "en",
          "favicon_url": "https://www.voaafrica.com/Content/responsive/VOA/en-US/img/voa_favicon.ico",
          "og_title": "Sudan Defends Taking UAE to ICJ for Allegedly Arming RSF",
          "og_description": "KHARTOUM — Sudan is defending its decision to file a case before the International Court of Justice accusing the United Arab Emirates of providing weapons and other support to the Rapid Support Forces battling Sudan’s army.",
          "og_image": "https://gdb.voanews.com/09410000-0a00-0242-3e34-08dac3493f7a_w1200_h675.jpg",
          "og_url": "https://www.voaafrica.com/a/sudan-defends-taking-uae-to-icj-for-allegedly-arming-rsf/8002061.html",
          "og_type": "article",
          "headings": [
            "Africa",
            "Sudan Defends Taking UAE to ICJ for Allegedly Arming RSF",
            "March 07, 2025 7:48 AM",
            "FILE - Smoke rises over Khartoum, Sudan, May 21, 2023, amid fighting between the army and the paramilitary Rapid Support Forces (RSF).",
            "KHARTOUM — Sudan is defending its decision to file a case before the International Court of Justice accusing the United Arab Emirates of providing weapons and other support to the Rapid Support Forces battling Sudan’s army.",
            "Sudan’s Foreign Ministry said Wednesday it presented evidence that the UAE provided weapons, financial and political support to the RSF, accusing the Gulf state of fueling the conflict and causing widespread destruction and human rights abuses.",
            "The UAE has not yet officially responded to the accusations. It has previously denied providing military support to any of the warring parties in Sudan.",
            "The ICJ, also known as the World Court, is the United Nations’ highest court for disputes between states. Its rulings are binding but difficult to enforce.",
            "The conflict in Sudan erupted in April 2024, after months of escalating tensions between the army and the RSF. The fighting has killed thousands of people and displaced millions more.",
            "Some analysts say the UAE’s support for the RSF is aimed at undermining the Sudanese government and gaining influence in the country.",
            "Others say the UAE is simply trying to protect its interests in Sudan and prevent the country from descending into further chaos."
          ],
          "domain_name": "www.voaafrica.com"
        }
      },
      {
        "22": {
          "url": "https://www.bbc.com/audio/play/p0kxhrlw",
          "title": "BBC World Service - Newscast, Sudan accuses UAE of backing genocide",
          "description": "Sudan has accused the United Arab Emirates of backing a paramilitary group it says is committing genocide.",
          "keywords": null,
          "author": null,
          "publication_date": null,
          "language": "en",
          "favicon_url": "https://www.bbc.com/favicon.ico",
          "og_title": "Sudan accuses UAE of backing genocide - Newscast",
          "og_description": "Sudan has accused the United Arab Emirates of backing a paramilitary group it says is committing genocide.",
          "og_image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0khxsct.jpg",
          "og_url": "https://www.bbc.com/audio/play/p0kxhrlw",
          "og_type": "audio",
          "headings": [],
          "domain_name": "www.bbc.com"
        }
      },
      {
        "23": {
          "url": "https://www.rfi.fr/en/africa/20250307-sudan-files-case-against-uae-at-un-court-over-complicity-in-genocide",
          "title": "Sudan files case against UAE at UN court over 'complicity in genocide'",
          "description": "Sudan has filed a case before the International Court of Justice (ICJ) against the United Arab Emirates (UAE), accusing it of funding a paramilitary group that is accused of atrocities.",
          "keywords": [
            "Sudan",
            "UAE",
            "ICJ",
            "genocide",
            "UN"
          ],
          "author": null,
          "publication_date": null,
          "language": "en",
          "favicon_url": "https://static.rfi.fr/meta_og_logo.png",
          "og_title": "Sudan files case against UAE at UN court over 'complicity in genocide'",
          "og_description": "Sudan has filed a case before the International Court of Justice (ICJ) against the United Arab Emirates (UAE), accusing it of funding a paramilitary group that is accused of atrocities.",
          "og_image": "https://static.rfi.fr/meta_og_twcard/RFI_FB.png",
          "og_url": "https://www.rfi.fr/en/africa/20250307-sudan-files-case-against-uae-at-un-court-over-complicity-in-genocide",
          "og_type": "article",
          "headings": [
            "Africa",
            "Sudan files case against UAE at UN court over 'complicity in genocide'",
            "A demonstrator holds a banner during a protest against the ongoing conflict between the Sudanese army and the paramilitary Rapid Support Forces (RSF) in Khartoum, Sudan, March 6, 2024.",
            "AFP",
            "Text by:",
            "RFI",
            "Sudan has filed a case before the International Court of Justice (ICJ) against the United Arab Emirates (UAE), accusing it of funding a paramilitary group that is accused of atrocities.",
            "In its application to the ICJ, Sudan said it was seeking “to obtain redress for the UAE’s violations of Sudan’s sovereignty, its interference in Sudan’s internal affairs, and its use of force against the Sudanese people”.",
            "The Sudanese foreign ministry said it had presented evidence that the UAE provided weapons and financial and political support to the RSF.",
            "It added that the UAE’s actions had fuelled the conflict and caused widespread destruction and human rights abuses.",
            "The UAE has not yet officially responded to the accusations. However, it has previously denied providing military support to any of the warring parties in Sudan.",
            "The ICJ has the authority to issue binding rulings on disputes between states, but its decisions are not always enforced.",
            "The conflict in Sudan erupted in April 2024, after months of escalating tensions between the army and the RSF. The fighting has killed thousands of people and displaced millions more.",
            "Last December, the US Treasury Department imposed sanctions on companies it said were financing the RSF and coordinating the procurement of weapons for the group. The Treasury said that some of these companies were based in the UAE."
          ],
          "domain_name": "www.rfi.fr"
        }
      },
      {
        "24": {
          "url": "https://opiniojuris.org/2025/03/14/art-ix-reservations-to-the-genocide-convention-are-here-to-stay-a-response-to-diamond/",
          "title": "Art. IX Reservations to the Genocide Convention Are Here to Stay? A Response to Diamond",
          "description": "In a recent post, Ashley Diamond argues that reservations to Article IX of the Genocide Convention are incompatible with the object and purpose of the Convention. In this post, Alexander Blanchard respectfully disagrees, and argues that such reservations should be considered permissible.",
          "keywords": null,
          "author": "Alexander Blanchard",
          "publication_date": null,
          "language": "en-US",
          "favicon_url": "https://opiniojuris.org/wp-content/uploads/2018/08/cropped-cropped-OJ-Favicon-1-32x32.png",
          "og_title": "Art. IX Reservations to the Genocide Convention Are Here to Stay? A Response to Diamond",
          "og_description": "In a recent post, Ashley Diamond argues that reservations to Article IX of the Genocide Convention are incompatible with the object and purpose of the Convention. In this post, Alexander Blanchard respectfully disagrees, and argues that such reservations should be considered permissible.",
          "og_image": "https://opiniojuris.org/wp-content/uploads/2024/03/ICJ-at-Peace-Palace.jpg",
          "og_url": "https://opiniojuris.org/2025/03/14/art-ix-reservations-to-the-genocide-convention-are-here-to-stay-a-response-to-diamond/",
          "og_type": "article",
          "headings": [
            "Opinio Juris",
            "Insights on International Law and Current Events",
            "Art. IX Reservations to the Genocide Convention Are Here to Stay? A Response to Diamond",
            "Alexander Blanchard",
            "March 14, 2025",
            "In a recent post, Ashley Diamond argues that reservations to Article IX of the Genocide Convention are incompatible with the object and purpose of the Convention. In this post, I respectfully disagree, and argue that such reservations should be considered permissible.",
            "By Alexander Blanchard",
            "Ashley Diamond’s recent post on Opinio Juris offers an insightful analysis of reservations to Article IX of the Genocide Convention. As Diamond notes, numerous states have entered reservations to Article IX, which provides that disputes between Contracting Parties relating to the interpretation, application or fulfilment of the Convention shall be submitted to the International Court of Justice (ICJ) at the request of any of the parties to the dispute. The reservations generally state that the reserving state’s consent is required before a dispute can be submitted to the ICJ.",
            "Diamond argues that these reservations are incompatible with the object and purpose of the Genocide Convention, and therefore impermissible under Article 19(c) of the Vienna Convention on the Law of Treaties (VCLT). Diamond contends that the object and purpose of the Genocide Convention is to prevent and punish genocide, and that Article IX is essential to achieving this object and purpose because it provides a mechanism for resolving disputes about the interpretation, application, or fulfilment of the Convention. Diamond suggests that, by reserving the right to decide whether to submit a dispute to the ICJ, reserving states undermine this mechanism and weaken the Convention’s ability to prevent and punish genocide.",
            "With all due respect, I disagree.",
            "In my view, reservations to Article IX should be considered permissible because they do not frustrate the object and purpose of the Genocide Convention. The object and purpose of the Genocide Convention is, as Diamond notes, to prevent and punish genocide. However, Article IX is not essential to achieving this object and purpose. Article IX merely provides one mechanism for resolving disputes about the interpretation, application, or fulfilment of the Convention. It is not the only mechanism, and it is not necessarily the most effective mechanism.",
            "Even without Article IX, states can still resolve disputes about the interpretation, application, or fulfilment of the Genocide Convention through other means, such as negotiation, mediation, conciliation, or arbitration. In fact, many states have successfully resolved disputes about the interpretation, application, or fulfilment of the Genocide Convention without ever submitting a case to the ICJ.",
            "Moreover, it is not clear that Article IX is always the most effective mechanism for resolving disputes about the interpretation, application, or fulfilment of the Genocide Convention. The ICJ is a court of law, and its decisions are based on legal principles. However, disputes about the interpretation, application, or fulfilment of the Genocide Convention often involve complex political and moral considerations that are not easily resolved by legal principles. In such cases, other mechanisms, such as negotiation or mediation, may be more effective.",
            "In addition, reservations to Article IX may actually encourage more states to become parties to the Genocide Convention. Some states may be hesitant to become parties to the Convention if they are required to submit all disputes to the ICJ. By allowing states to reserve the right to decide whether to submit a dispute to the ICJ, reservations to Article IX may make the Convention more attractive to these states.",
            "To be clear, I am not arguing that reservations to Article IX are always permissible. In some cases, reservations to Article IX may be so broad or so vague that they do frustrate the object and purpose of the Genocide Convention. However, I believe that, in general, reservations to Article IX should be considered permissible because they do not frustrate the object and purpose of the Convention, and they may actually encourage more states to become parties to the Convention.",
            "Alexander Blanchard is a recent graduate of Harvard Law School. He will be clerking on the Ninth Circuit Court of Appeals in the 2025-2026 term."
          ],
          "domain_name": "opiniojuris.org"
        }
      },
      {
        "25": {
          "url": "https://sudantribune.com/article298220/",
          "title": "Sudan files case against UAE at UN court over Darfur genocide",
          "description": "The Sudanese government has officially filed a case before the International Court of Justice (ICJ), accusing the United Arab Emirates (UAE) of supporting the Rapid Support Forces (RSF) in what it describes as a genocidal campaign in Darfur.",
          "keywords": null,
          "author": null,
          "publication_date": null,
          "language": null,
          "favicon_url": "https://sudantribune.com/IMG/siteon0.png",
          "og_title": "Sudan files case against UAE at UN court over Darfur genocide",
          "og_description": "The Sudanese government has officially filed a case before the International Court of Justice (ICJ), accusing the United Arab Emirates (UAE) of supporting the Rapid Support Forces (RSF) in what it describes as a genocidal campaign in Darfur.",
          "og_image": "https://sudantribune.com/IMG/jpg/RSF_fighters_Khartoum_North.jpg",
          "og_url": "https://sudantribune.com/article298220/",
          "og_type": "article",
          "headings": [
            "Sudan files case against UAE at UN court over Darfur genocide",
            "March 7, 2025 (KHARTOUM) - The Sudanese government has officially filed a case before the International Court of Justice (ICJ), accusing the United Arab Emirates (UAE) of supporting the Rapid Support Forces (RSF) in what it describes as a genocidal campaign in Darfur.",
            "In a statement released on Wednesday, the Ministry of Foreign Affairs announced the submission of the case, asserting that the UAE’s support for the RSF constitutes a violation of Sudan’s sovereignty and interference in its internal affairs.",
            "The Ministry further emphasized that the UAE’s actions have exacerbated the conflict, resulting in widespread destruction, numerous civilian casualties, and a severe humanitarian crisis.",
            "“The evidence presented demonstrates the UAE’s provision of weapons, financial assistance, and political support to the RSF, thereby fueling the conflict and undermining the stability of Sudan,” the statement read.",
            "The Sudanese government seeks redress for the UAE’s alleged violations of international law, including breaches of the UN Charter, the Genocide Convention, and the International Covenant on Civil and Political Rights.",
            "The UAE has yet to respond to the accusations. However, it has consistently denied providing military support to any of the warring parties in Sudan, maintaining its commitment to a peaceful resolution to the conflict.",
            "The ICJ, the principal judicial organ of the United Nations, is tasked with settling disputes between states in accordance with international law. Its rulings are binding, but enforcement mechanisms remain limited.",
            "The conflict in Sudan, which erupted in April 2023, has resulted in a dire humanitarian situation, with millions displaced and facing acute shortages of food, water, and medical care. The UN has warned of the potential for further escalation and widespread atrocities if the fighting continues unabated.",
            "(ST)"
          ],
          "domain_name": "sudantribune.com"
        }
      },
      {
        "26": {
          "url": "https://www.thedailystar.net/news/world/news/sudan-files-case-against-uae-icj-3841446",
          "title": "Sudan files case against UAE at ICJ",
          "description": "Sudan has filed a case before the International Court of Justice (ICJ) against the United Arab Emirates (UAE), accusing it of supporting the Rapid Support Forces (RSF).",
          "keywords": null,
          "author": null,
          "publication_date": null,
          "language": "en",
          "favicon_url": "https://www.thedailystar.net/sites/all/themes/dailystar/favicon.ico",
          "og_title": "Sudan files case against UAE at ICJ",
          "og_description": "Sudan has filed a case before the International Court of Justice (ICJ) against the United Arab Emirates (UAE), accusing it of supporting the Rapid Support Forces (RSF).",
          "og_image": "https://www.thedailystar.net/sites/default/files/styles/social_share/public/images/2024/03/07/icj.jpg?itok=Q04FGW-V",
          "og_url": "https://www.thedailystar.net/news/world/news/sudan-files-case-against-uae-icj-3841446",
          "og_type": "article",
          "headings": [
            "World",
            "Sudan files case against UAE at ICJ",
            "AFP",
            "07 March, 2025 08:40 PM",
            "Sudan has filed a case before the International Court of Justice (ICJ) against the United Arab Emirates (UAE), accusing it of supporting the Rapid Support Forces (RSF).",
            "In its application to the ICJ, Sudan said it was seeking \"to obtain redress for the UAE's violations of Sudan's sovereignty, its interference in Sudan's internal affairs, and its use of force against the Sudanese people\".",
            "The Sudanese foreign ministry said it had presented evidence that the UAE provided weapons and financial and political support to the RSF.",
            "It added that the UAE's actions had fuelled the conflict and caused widespread destruction and human rights abuses.",
            "The UAE has not yet officially responded to the accusations. However, it has previously denied providing military support to any of the warring parties in Sudan.",
            "The ICJ has the authority to issue binding rulings on disputes between states, but its decisions are not always enforced.",
            "The conflict in Sudan erupted in April 2023, after months of escalating tensions between the army and the RSF. The fighting has killed thousands of people and displaced millions more.",
            ""
          ],
          "domain_name": "www.thedailystar.net"
        }
      },
      {
        "27": {
          "url": "https://newscentral.africa/sudan-takes-uae-to-icj-over-alleged-support-for-rsf-in-civil-war/",
          "title": "Sudan Takes UAE to ICJ Over Alleged Support for RSF in Civil War",
          "description": "Sudan has officially filed a case with the International Court of Justice (ICJ) against the United Arab Emirates (UAE), accusing the Gulf nation of providing support to the Rapid Support Forces (RSF) battling the Sudanese army.",
          "keywords": "Sudan, UAE, ICJ, RSF, Civil War, Africa, News Central",
          "author": "News Central Team",
          "publication_date": null,
          "language": "en-US",
          "favicon_url": "https://newscentral.africa/wp-content/uploads/2023/03/cropped-News-Central-Favicon-32x32.png",
          "og_title": "Sudan Takes UAE to ICJ Over Alleged Support for RSF in Civil War",
          "og_description": "Sudan has officially filed a case with the International Court of Justice (ICJ) against the United Arab Emirates (UAE), accusing the Gulf nation of providing support to the Rapid Support Forces (RSF) battling the Sudanese army.",
          "og_image": "https://newscentral.africa/wp-content/uploads/2024/03/Sudan-UAE-ICJ-case.jpg",
          "og_url": "https://newscentral.africa/sudan-takes-uae-to-icj-over-alleged-support-for-rsf-in-civil-war/",
          "og_type": "article",
          "headings": [
            "Sudan Takes UAE to ICJ Over Alleged Support for RSF in Civil War",
            "News Central Team",
            "March 7, 2025",
            "Khartoum, Sudan – Sudan has officially filed a case with the International Court of Justice (ICJ) against the United Arab Emirates (UAE), accusing the Gulf nation of providing support to the Rapid Support Forces (RSF) battling the Sudanese army.",
            "In a statement released on Wednesday, Sudan’s Foreign Ministry said it had presented evidence that the UAE provided weapons, financial and political support to the RSF, accusing the Gulf state of fueling the conflict and causing widespread destruction and human rights abuses.",
            "“The UAE’s actions have not only prolonged the conflict but have also exacerbated the humanitarian crisis, leading to immense suffering for the Sudanese people,” the ministry said.",
            "The UAE has not yet officially responded to the accusations. However, it has previously denied providing military support to any of the warring parties in Sudan.",
            "The ICJ, also known as the World Court, is the United Nations’ highest court for disputes between states. Its rulings are binding but difficult to enforce.",
            "The conflict in Sudan erupted in April 2023, after months of escalating tensions between the army and the RSF. The fighting has killed thousands of people and displaced millions more.",
            "The Sudanese government’s decision to take the UAE to the ICJ marks a significant escalation in the diplomatic fallout from the conflict. It remains to be seen what impact the case will have on the ground in Sudan."
          ],
          "domain_name": "newscentral.africa"
        }
    },
    {
      "28": {
        "url": "https://worldpeacefoundation.org/blog/sudan-genocide-case/",
        "title": "Genocide in Sudan: How Should the ICJ Treat the Case?",
        "description": "Sudan has filed a genocide case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), alleging the UAE's complicity through support for the Rapid Support Forces (RSF) accused of committing atrocities against the Masalit people in West Darfur.",
        "keywords": "Sudan, UAE, ICJ, RSF, Genocide, Masalit, Darfur, World Peace Foundation",
        "author": "Alex de Waal",
        "publication_date": "2025-03-20",
        "language": "en-US",
        "favicon_url": "https://worldpeacefoundation.org/favicon.ico",
        "og_title": "Genocide in Sudan: How Should the ICJ Treat the Case?",
        "og_description": "An analysis of Sudan's genocide case against the UAE at the ICJ, focusing on the RSF's alleged atrocities against the Masalit people and the implications for international justice.",
        "og_image": "https://worldpeacefoundation.org/wp-content/uploads/2025/03/peace_palace_the_hague.jpg",
        "og_url": "https://worldpeacefoundation.org/blog/sudan-genocide-case/",
        "og_type": "article",
        "headings": [
          "Genocide in Sudan: How Should the ICJ Treat the Case?",
          "Alex de Waal",
          "March 20, 2025",
          "Sudan has brought a genocide case to the International Court of Justice (ICJ) in The Hague. The Court should act quickly—and not confine itself to the specific demands made by the Sudanese military leader General Abdel Fattah al-Burhan.",
          "The United Nations-recognized Government of Sudan (GoS) has instituted proceedings against the United Arab Emirates in the International Court of Justice. The basis of the claim is that the Rapid Support Forces (RSF) have committed genocide against the Masalit people of West Darfur, and that the UAE is 'complicit in the genocide on the Masalit through its direction of and provision of extensive financial, political, and military support for the rebel RSF militia.' The GoS is demanding that the Court order immediate provisional measures for the UAE to fulfil its commitments to prevent acts of genocide.",
          "The evidence for genocidal acts by the RSF, against the Masalit and other communities elsewhere in Sudan, is strong. Human Rights Watch has spoken of 'ethnic cleansing.' The United States has issued a genocide determination. The Special Advisor to the UN Secretary-General on the Prevention of Genocide, Alice Wairimu Nderitu, has raised the alarm of similar crimes elsewhere in Darfur. The strongest case is made by the self-incriminating 'trophy' videos taken and circulated by RSF members of their own atrocities.",
          "It’s possible that the International Criminal Court (ICC), which has a mandate for Darfur dating back twenty years, may issue arrest warrants against RSF leaders for genocide, including its leader, General Mohamed Hamdan Dagolo, known as 'Hemedti'. But unlike the ICC, which prosecutes individuals for international crimes, the ICJ deals with states only. This means that al-Burhan cannot bring the RSF as a political-military organization to court. Instead, he has turned to its sponsor.",
          "The evidence for the UAE's support to the RSF is strong, including weapons smuggled under the cover of humanitarian flights, while UAE denials have not convinced US lawmakers.",
          "The ICJ should hear the case promptly and issue provisional orders.",
          "The judges at the ICJ should also go beyond the specific orders requested by the GoS, in three respects.",
          "First, the Court should also order the UAE to do its utmost to ensure that the RSF does not commit genocide by starvation. Article 2(c) of the Genocide Convention prohibits 'Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part.' The RSF siege of al-Fashir and the nearby camps for internally displaced persons, and attacks on essential health facilities, have been causing mass starvation there for a year. Many people in the city and the IDP camps are from the Zaghawa ethnic group, and there is good reason to believe that the RSF may be targeting them on the basis of that identity. The Court should not wait for proof that the RSF is committing genocide by starvation. It should also order the UAE to do all in its power to provide humanitarian assistance and essential services to the besieged population, both directly and through pressing the RSF to permit such assistance.",
          "Al-Burhan’s foreign ministry has denied that famine is happening in Sudan and expelled the UN’s Integrated food security Phase Classification (IPC) for determining that it is. The Court should assess the facts, including the IPC’s objective and impartial assessment."
        ],
        "domain_name": "worldpeacefoundation.org"
      }
    },
    {
      "29": {
        "url": "https://opiniojuris.org/2025/03/18/the-jus-cogens-nature-of-the-prohibition-of-genocide-in-sudan-v-uae-a-new-case-the-same-old-omission/",
        "title": "The jus cogens Nature of the Prohibition of Genocide in Sudan v. UAE: A New Case, the Same Old Omission",
        "description": "An analysis of Sudan's legal proceedings against the UAE at the International Court of Justice for alleged breaches of the Genocide Convention, focusing on the implications of the jus cogens nature of the prohibition of genocide.",
        "keywords": "Sudan, UAE, ICJ, Genocide Convention, jus cogens, Masalit, legal analysis, international law",
        "author": "Luciano Pezzano",
        "publication_date": "2025-03-18",
        "language": "en-US",
        "favicon_url": "https://opiniojuris.org/favicon.ico",
        "og_title": "The jus cogens Nature of the Prohibition of Genocide in Sudan v. UAE: A New Case, the Same Old Omission",
        "og_description": "An exploration of the legal consequences of Sudan's case against the UAE at the ICJ, emphasizing the peremptory norm status of the prohibition of genocide.",
        "og_image": "https://opiniojuris.org/wp-content/uploads/2025/03/genocide_convention_image.jpg",
        "og_url": "https://opiniojuris.org/2025/03/18/the-jus-cogens-nature-of-the-prohibition-of-genocide-in-sudan-v-uae-a-new-case-the-same-old-omission/",
        "og_type": "article",
        "headings": [
          "The jus cogens Nature of the Prohibition of Genocide in Sudan v. UAE: A New Case, the Same Old Omission",
          "Luciano Pezzano",
          "March 18, 2025",
          "On 5 March 2025, the Republic of Sudan instituted proceedings before the International Court of Justice (ICJ) against the United Arab Emirates (UAE) for breaches of the Genocide Convention.",
          "The case presents numerous legal issues, including the value of the UAE’s reservation to Article IX of the Convention, attribution of responsibility, and the fact that the victims of the alleged genocide—the Masalit people—are also victims in the case against former Sudanese President Omar Al Bashir at the International Criminal Court.",
          "A notable omission in Sudan’s Application is the lack of emphasis on the legal consequences of genocide as a grave breach of a peremptory norm (jus cogens) of general international law.",
          "Genocide is recognized as a peremptory norm, meaning its prohibition is absolute and non-derogable.",
          "The International Court of Justice (ICJ) recognized the peremptory nature of the prohibition of genocide in its 2006 Judgment in the DRC v. Rwanda case and reiterated it in the 2007 Judgment on the merits in the Bosnia and Herzegovina v. Serbia case.",
          "Other international tribunals, such as the International Criminal Tribunal for the former Yugoslavia (ICTY) and the Inter-American Court of Human Rights (IACtHR), have also recognized the peremptory status of the prohibition of genocide.",
          "The International Law Commission (ILC) included the prohibition of genocide in its non-exhaustive list of peremptory norms in its 2022 Draft Conclusions on jus cogens.",
          "Despite the recognition of genocide as a peremptory norm, cases before the ICJ under the Genocide Convention often omit requests for the Court to declare additional consequences for genocide, such as aggravated responsibility for the responsible State or duties for third States.",
          "This pattern of omission undermines the hierarchical position of peremptory norms in the international legal system and the special legal consequences that should arise from serious breaches of such norms.",
          "The article argues for the need to determine the consequences of genocide as a serious breach of jus cogens to reflect the hierarchical position of peremptory norms in the international legal system."
        ],
        "domain_name": "opiniojuris.org"
      }
    },
    {
      "30": {
        "url": "https://www.dw.com/en/could-sudan-be-split-into-two-countries/a-71923002",
        "title": "Could Sudan be split into two countries?",
        "description": "An analysis of the potential for Sudan's partition amid ongoing civil conflict between the Sudanese Armed Forces (SAF) and the Rapid Support Forces (RSF), exploring historical precedents, current developments, and international perspectives.",
        "keywords": "Sudan, partition, civil war, SAF, RSF, South Sudan, international intervention, humanitarian crisis",
        "author": "Mohammed Amin",
        "publication_date": "2025-03-15",
        "language": "en-US",
        "favicon_url": "https://www.dw.com/favicon.ico",
        "og_title": "Could Sudan be split into two countries?",
        "og_description": "Exploring the possibility of Sudan's partition as ongoing conflicts between the SAF and RSF continue, drawing parallels with South Sudan's secession and assessing current dynamics.",
        "og_image": "https://www.dw.com/image/71923002_304.jpg",
        "og_url": "https://www.dw.com/en/could-sudan-be-split-into-two-countries/a-71923002",
        "og_type": "article",
        "headings": [
          "Could Sudan be split into two countries?",
          "Mohammed Amin",
          "March 15, 2025",
          "The ongoing civil war in Sudan between the Sudanese Armed Forces (SAF) and the Rapid Support Forces (RSF) has raised concerns about the potential partition of the country.",
          "Historical Context: South Sudan's Independence",
          "In 2011, South Sudan seceded from Sudan following a referendum, becoming an independent nation. This partition was the culmination of decades of conflict and negotiations.",
          "Current Conflict and Control",
          "As of early 2025, the SAF has made significant advances, regaining control over much of Khartoum. However, the RSF maintains strongholds in regions like Darfur and parts of Kordofan.",
          "RSF's Parallel Government Initiative",
          "The RSF has announced plans to establish a parallel government, termed the 'Government of Peace and Unity,' to administer areas under its control, signaling a move towards potential secession.",
          "International Perspectives",
          "US Special Envoy Tom Perriello has warned that Sudan risks partition or becoming a failed state if the conflict continues, emphasizing the need for a revived democratic transition to achieve lasting peace.",
          "Humanitarian Crisis",
          "The conflict has resulted in over 14 million displaced individuals and severe food shortages, with parts of the country facing famine. The humanitarian situation continues to deteriorate amid ongoing violence."
        ],
        "domain_name": "dw.com"
      }
    },
    {
      "31": {
        "url": "https://www.juancole.com/2025/03/sudan-justice-genocide.html",
        "title": "Sudan Takes UAE to International Court of Justice for Genocide: A Test for International Justice",
        "description": "An analysis of Sudan's legal action against the United Arab Emirates at the International Court of Justice, accusing the UAE of breaching the Genocide Convention by supporting the Rapid Support Forces implicated in atrocities against the Masalit people in West Darfur.",
        "keywords": "Sudan, UAE, International Court of Justice, Genocide Convention, Rapid Support Forces, Masalit, West Darfur, international law",
        "author": "Walid El Houri",
        "publication_date": "2025-03-16",
        "language": "en-US",
        "favicon_url": "https://www.juancole.com/favicon.ico",
        "og_title": "Sudan Takes UAE to International Court of Justice for Genocide: A Test for International Justice",
        "og_description": "An examination of Sudan's case against the UAE at the ICJ, focusing on allegations of the UAE's support for the RSF and the implications for international justice.",
        "og_image": "https://www.juancole.com/wp-content/uploads/2025/03/ICJ_building.jpg",
        "og_url": "https://www.juancole.com/2025/03/sudan-justice-genocide.html",
        "og_type": "article",
        "headings": [
          "Sudan Takes UAE to International Court of Justice for Genocide: A Test for International Justice",
          "Walid El Houri",
          "March 16, 2025",
          "On March 6, 2025, Sudan initiated legal proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of breaching the Genocide Convention by supporting the Rapid Support Forces (RSF), a paramilitary group implicated in atrocities against the Masalit people in Sudan’s West Darfur region. The UAE has denied the accusations.",
          "Historical Accusations",
          "The allegations against the UAE are not isolated. In October 2024, the RSF mistakenly shot down a military plane in Sudan’s Malha region, killing two Russian crew members and three Sudanese on board. The Conflict Observatory identified the aircraft as an Ilyushin Il-76, affiliated with Kyrgyzstan’s New Way Cargo, suggesting involvement in arms shipments from the UAE to the RSF. Identity documents found at the crash site included a passport and an ID of a Russian linked to a UAE-based company, Airline Transport Incorporation FZC.",
          "Prior to this incident, the Sudanese government had been repeatedly accusing the UAE of arming the RSF and prolonging the war while profiting from “the illegal exploitation of gold.” In October 2024, Khalid Ali Aleisir, Minister of Culture and Information in Sudan, shared a video of what he claimed was evidence of UAE supplying weapons to the RSF.",
          "Context of the War",
          "The almost two-year-long round of violence is the fourth civil war in the country’s history. The violence, fueled by ethnic and tribal divisions, can be traced back to the rule of former president Omar al-Bashir, lasting from 1989 to 2019 before being ousted in a popular revolution. A fragile civilian-military coalition ensued but soon collapsed under a military coup led by al-Burhan in October 2021.",
          "Following the coup, tensions increased between the military and the RSF, especially over plans to integrate the latter into the army. This culminated on April 15, 2023, when RSF units launched coordinated attacks on Sudanese Armed Forces (SAF) targets, including in key locations in the capital Khartoum, marking the beginning of the war.",
          "The RSF, originally formed from the Janjaweed militias accused of atrocities in Darfur during the early 2000s, has been implicated in severe human rights violations, including attacks on the Masalit community in West Darfur.",
          "According to data from the Armed Conflict Location & Event Data (ACLED), by the end of November 2024, over 28,000 people have been killed, though some estimate that the real number is far higher and could be as high as 150,000.",
          "Recent numbers from the International Organization for Migration estimate that more than 14 million Sudanese have been displaced since the beginning of the fighting in April 2023, including more than 3.5 million who have crossed the borders to seek refuge in neighboring countries. That is almost 30 percent of the total population of the country, with half the population in need of humanitarian help.",
          "Human Rights Watch (HRW) has accused both warring parties of bombing populated areas indiscriminately, with RSF “deliberately targeting hospitals,” according to Mohamed Osman, researcher for their Africa division.",
          "The UAE’s Role in Other Conflicts",
          "Beyond Sudan, the UAE has faced scrutiny for its involvement in various regional conflicts. In Yemen, the UAE has been a key member of the Saudi-led coalition against Houthi rebels, a campaign criticized for causing civilian casualties and a humanitarian disaster."
        ],
        "domain_name": "juancole.com"
      }
    },
    {
      "32": {
        "url": "https://www.middleeasteye.net/news/uk-enrages-sudanese-army-inviting-uae-london-peace-conference",
        "title": "UK enrages Sudanese army government by inviting UAE to London conference",
        "description": "The UK's decision to invite the UAE to a London conference on Sudan's humanitarian crisis, while excluding Sudan's army-aligned government, has sparked outrage in Khartoum.",
        "keywords": "UK, UAE, Sudan, London conference, Rapid Support Forces, RSF, humanitarian crisis, diplomatic tensions",
        "author": "Middle East Eye Staff",
        "publication_date": "2025-03-15",
        "language": "en-GB",
        "favicon_url": "https://www.middleeasteye.net/sites/default/files/favicon.ico",
        "og_title": "UK enrages Sudanese army government by inviting UAE to London conference",
        "og_description": "Sudan's army-aligned government expresses outrage over the UK's decision to invite the UAE to a London conference on Sudan's humanitarian crisis, citing the UAE's alleged support for the RSF.",
        "og_image": "https://www.middleeasteye.net/sites/default/files/styles/article_page/public/images-story/sudanese_soldiers.jpg",
        "og_url": "https://www.middleeasteye.net/news/uk-enrages-sudanese-army-inviting-uae-london-peace-conference",
        "og_type": "article",
        "headings": [
          "UK enrages Sudanese army government by inviting UAE to London conference",
          "Middle East Eye Staff",
          "March 15, 2025",
          "The UK's decision to invite the United Arab Emirates (UAE) to a London conference addressing Sudan's humanitarian crisis, while excluding Sudan's army-aligned government, has sparked outrage in Khartoum.",
          "Sudan's foreign ministry criticized the UK's move, stating that the presence of the UAE, alleged to support the Rapid Support Forces (RSF), reduces the conference to a 'public relations stunt.'",
          "The conference aims to address the escalating humanitarian crisis in Sudan, which has displaced millions and led to widespread famine.",
          "The UK's Foreign Office defended its stance, emphasizing the involvement of regional and international stakeholders to end the war and provide humanitarian aid.",
          "Representatives from Qatar, Egypt, Turkey, and Saudi Arabia, known to favor the Sudanese army over the RSF, are also expected to participate in the conference."
        ],
        "domain_name": "middleeasteye.net"
      }
    },
    {
      "33": {
        "url": "https://www.newagebd.net/post/opinion/260271/prospect-of-icj-masalit-genocide-case",
        "title": "Prospect of ICJ Masalit Genocide Case",
        "description": "An analysis of Sudan's legal proceedings against the United Arab Emirates at the International Court of Justice, alleging the UAE's complicity in genocidal acts committed against the Masalit group in Darfur by the Rapid Support Forces.",
        "keywords": "Sudan, UAE, ICJ, Genocide Convention, Masalit, Darfur, Rapid Support Forces, international law",
        "author": "Quazi Omar Foysal",
        "publication_date": "2025-03-17",
        "language": "en-US",
        "favicon_url": "https://www.newagebd.net/favicon.ico",
        "og_title": "Prospect of ICJ Masalit Genocide Case",
        "og_description": "An exploration of the legal challenges and implications of Sudan's case against the UAE at the ICJ, focusing on allegations of the UAE's support for the RSF and the ensuing genocidal acts against the Masalit people.",
        "og_image": "https://www.newagebd.net/files/2025/03/17/260271/masalit_genocide_case.jpg",
        "og_url": "https://www.newagebd.net/post/opinion/260271/prospect-of-icj-masalit-genocide-case",
        "og_type": "article",
        "headings": [
          "Prospect of ICJ Masalit Genocide Case",
          "Quazi Omar Foysal",
          "March 17, 2025",
          "Sudan's Legal Action Against the UAE",
          "Sudan has initiated proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), alleging that the UAE is violating obligations under the Genocide Convention by supporting the Rapid Support Forces (RSF) accused of committing genocidal acts against the Masalit group in Darfur.",
          "Historical Context and Previous Accusations",
          "The allegations are not new; Sudan has previously accused the UAE of supporting the RSF in statements at the United Nations General Assembly and the UN Security Council. The United States has also accused the RSF of committing genocide and imposed sanctions on UAE-based companies linked to the RSF and its leader, Mohamed Hamdan Dagalo.",
          "Legal Challenges and Jurisdictional Issues",
          "The case presents several legal challenges, including questions about the ICJ's jurisdiction based on Article IX of the Genocide Convention, the UAE's reservations to this article, and the attribution of responsibility for the alleged genocidal acts.",
          "Potential Outcomes and International Implications",
          "The outcome of this case could have significant implications for international law, particularly concerning state responsibility for complicity in genocide and the enforcement of the Genocide Convention."
        ],
        "domain_name": "newagebd.net"
      }
    },
    {
      "34": {
        "url": "https://www.tbsnews.net/world/sudan-files-case-against-uae-top-un-court-over-complicity-genocide-1086406",
        "title": "Sudan files case against UAE at top UN court over 'complicity in genocide'",
        "description": "Sudan has initiated legal proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of violating the Genocide Convention by supporting the Rapid Support Forces (RSF), implicated in atrocities against the Masalit people in West Darfur.",
        "keywords": "Sudan, UAE, ICJ, Genocide Convention, Rapid Support Forces, RSF, Masalit, West Darfur, international law",
        "author": "The Business Standard",
        "publication_date": "2025-03-06",
        "language": "en-US",
        "favicon_url": "https://www.tbsnews.net/sites/default/files/favicon.ico",
        "og_title": "Sudan files case against UAE at top UN court over 'complicity in genocide'",
        "og_description": "Sudan has filed a case at the International Court of Justice accusing the UAE of breaching the Genocide Convention by supporting the RSF, implicated in genocidal acts against the Masalit people.",
        "og_image": "https://www.tbsnews.net/sites/default/files/styles/big_2/public/images/2025/03/06/icj_building.jpg",
        "og_url": "https://www.tbsnews.net/world/sudan-files-case-against-uae-top-un-court-over-complicity-genocide-1086406",
        "og_type": "article",
        "headings": [
          "Sudan files case against UAE at top UN court over 'complicity in genocide'",
          "The Business Standard",
          "March 6, 2025",
          "Sudan has initiated legal proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of violating its obligations under the Genocide Convention.",
          "The case centers on allegations that the UAE provided financial and military support to the Rapid Support Forces (RSF), a paramilitary group implicated in atrocities against the Masalit people in West Darfur.",
          "The Sudanese government asserts that this support amounts to complicity in acts of genocide, murder, rape, and other human rights violations committed by the RSF.",
          "The UAE has dismissed the allegations as baseless and stated its intention to seek immediate dismissal of the case.",
          "The conflict between the Sudanese Armed Forces and the RSF, which began in April 2023, has resulted in significant loss of life and displacement, with the Masalit community in West Darfur particularly affected.",
          "The ICJ's rulings are legally binding, but the judicial process can be protracted, with final decisions potentially taking years."
        ],
        "domain_name": "tbsnews.net"
      }
    },
    {
      "35": {
        "url": "https://www.newarab.com/news/sudan-vs-uae-icj-why-darfur-genocide-claims-are-focus",
        "title": "Sudan vs UAE at the ICJ: Why Darfur genocide claims are in focus",
        "description": "An analysis of Sudan's legal case against the United Arab Emirates at the International Court of Justice, alleging the UAE's complicity in genocide due to its support for the Rapid Support Forces implicated in atrocities against the Masalit people in West Darfur.",
        "keywords": "Sudan, UAE, ICJ, Genocide Convention, Rapid Support Forces, RSF, Masalit, West Darfur, international law",
        "author": "Matthew Hoare",
        "publication_date": "2025-03-08",
        "language": "en-US",
        "favicon_url": "https://www.newarab.com/favicon.ico",
        "og_title": "Sudan vs UAE at the ICJ: Why Darfur genocide claims are in focus",
        "og_description": "An exploration of the legal implications and challenges of Sudan's case against the UAE at the ICJ, focusing on allegations of the UAE's support for the RSF and the resulting genocidal acts against the Masalit people.",
        "og_image": "https://www.newarab.com/sites/default/files/styles/article_page/public/2025-03/ICJ_building.jpg",
        "og_url": "https://www.newarab.com/news/sudan-vs-uae-icj-why-darfur-genocide-claims-are-focus",
        "og_type": "article",
        "headings": [
          "Sudan vs UAE at the ICJ: Why Darfur genocide claims are in focus",
          "Matthew Hoare",
          "March 8, 2025",
          "Sudan has filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the Gulf state of complicity in genocide due to its alleged backing of the rebel Rapid Support Forces (RSF) militia.",
          "In its application, Sudan has accused the UAE of being 'complicit in the genocide' allegedly carried out by the RSF against the Masalit people in West Darfur.",
          "It alleges that Abu Dhabi has provided 'extensive financial, political and military support' to the rebel group as it wages war against the country's armed forces.",
          "The militia has been accused of perpetrating several massacres against the Masalit in West Darfur since the country's civil war broke out in April 2023. According to a UN report, between 10,000 and 15,000 people were killed in a single city during 2023.",
          "The governor of West Darfur, Khamis Abakar, described the killings as a genocide shortly before he was killed by the RSF in 2023.",
          "Sudan wants the 15 judges on the panel to approve provisional measures ordering the UAE to prevent acts of genocide being perpetrated in Darfur.",
          "The ICJ is the principal judicial organ of the United Nations and settles legal disputes between states. Its rulings are binding, but the court has no means to enforce them.",
          "Sudan's application is likely to face significant hurdles before it is accepted by the court.",
          "The UAE has made a reservation to Article IX of the Genocide Convention, which grants the ICJ jurisdiction over disputes between contracting parties.",
          "This means that the court may not have jurisdiction to hear the case unless the UAE consents to it.",
          "Even if the court finds that it has jurisdiction, Sudan will need to provide evidence that the UAE was complicit in the alleged genocide.",
          "Complicity in genocide requires a high threshold of proof, and Sudan will need to demonstrate that the UAE had knowledge of the RSF's intent to commit genocide and provided support that had a substantial effect on the commission of the crime.",
          "The case highlights the challenges of holding states accountable for their alleged involvement in atrocities committed by non-state actors in foreign conflicts."
        ],
        "domain_name": "newarab.com"
      }
    },
    {
      "36": {
        "url": "https://www.newarab.com/news/sudan-files-case-against-uae-icj-complicity-genocide",
        "title": "Sudan files case against UAE at ICJ for 'complicity in genocide'",
        "description": "Sudan has filed a case at the International Court of Justice accusing the United Arab Emirates of complicity in genocide due to its alleged support for the Rapid Support Forces implicated in atrocities against the Masalit people in West Darfur.",
        "keywords": "Sudan, UAE, ICJ, Genocide Convention, Rapid Support Forces, RSF, Masalit, West Darfur, international law",
        "author": "The New Arab Staff & Agencies",
        "publication_date": "2025-03-06",
        "language": "en-US",
        "favicon_url": "https://www.newarab.com/favicon.ico",
        "og_title": "Sudan files case against UAE at ICJ for 'complicity in genocide'",
        "og_description": "Sudan has filed a case at the International Court of Justice accusing the UAE of complicity in genocide due to its alleged support for the RSF implicated in atrocities against the Masalit people in West Darfur.",
        "og_image": "https://www.newarab.com/sites/default/files/styles/article_page/public/2025-03/rsf_sudan.jpg",
        "og_url": "https://www.newarab.com/news/sudan-files-case-against-uae-icj-complicity-genocide",
        "og_type": "article",
        "headings": [
          "Sudan files case against UAE at ICJ for 'complicity in genocide'",
          "The New Arab Staff & Agencies",
          "March 6, 2025",
          "Sudan has filed a case against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the Gulf state of complicity in genocide over its alleged support for Sudan's paramilitary Rapid Support Forces (RSF).",
          "Khartoum contends the UAE is 'complicit in the genocide on the Masalit [community in Sudan] through its direction of and provision of extensive financial, political, and military support for the rebel RSF militia,' the ICJ said in a statement.",
          "The UAE, which has repeatedly denied supporting the RSF, dismissed the case as a 'publicity stunt' and said it would try to have it thrown out.",
          "The case 'is nothing more than a cynical publicity stunt aimed at diverting attention,' a UAE official said in a statement, adding: 'The UAE will seek the immediate dismissal of this baseless application.'",
          "For nearly two years, the RSF and the regular army in Sudan have fought a war that has killed tens of thousands of people and uprooted more than 12 million. Famine has been declared in parts of the country."
        ],
        "domain_name": "newarab.com"
      }
    },
{
  "37": {
    "url": "https://countervortex.org/blog/sudan-sues-uae-for-complicity-in-darfur-genocide/",
    "title": "Sudan sues UAE for complicity in Darfur genocide",
    "description": "Sudan has initiated legal proceedings against the United Arab Emirates (UAE) at the International Court of Justice (ICJ), accusing the UAE of violating the Genocide Convention by supporting the Rapid Support Forces (RSF) implicated in genocidal acts against the Masalit people in West Darfur.",
    "keywords": "Sudan, UAE, ICJ, Genocide Convention, Rapid Support Forces, RSF, Masalit, West Darfur, international law",
    "author": "Jurist",
    "publication_date": "2025-03-15",
    "language": "en-US",
    "favicon_url": "https://countervortex.org/favicon.ico",
    "og_title": "Sudan sues UAE for complicity in Darfur genocide",
    "og_description": "An analysis of Sudan's legal action against the UAE at the ICJ, focusing on allegations of the UAE's support for the RSF and the implications for international justice.",
    "og_image": "https://countervortex.org/wp-content/uploads/2025/03/darfur.jpg",
    "og_url": "https://countervortex.org/blog/sudan-sues-uae-for-complicity-in-darfur-genocide/",
    "og_type": "article",
    "headings": [
      "Sudan sues UAE for complicity in Darfur genocide",
      "Jurist",
      "March 15, 2025",
      "Sudan has instituted proceedings against the United Arab Emirates (UAE) before the International Court of Justice (ICJ), alleging that the UAE has directly supported the paramilitary Rapid Support Forces (RSF) and its associated militias in West Darfur state, thereby violating the Genocide Convention.",
      "The claim is based on weapons seized by the Sudanese Armed Forces in active war zones, including armored personnel carriers and 4×4 combat vehicles originating from the UAE. Sudan asserts that these supplies have enabled the RSF to commit genocidal acts in West Darfur, such as killings of civilians and deprivation of access to medical care and basic necessities.",
      "Additionally, Sudan accuses the UAE of providing travel assistance to the RSF's commander-in-chief and hosting RSF business activities, actions that allegedly violate U.S. sanctions. In January 2025, the U.S. imposed sanctions on RSF leader Mohamed Hamdan Dagalo and seven RSF-linked companies based in the UAE for committing genocide.",
      "The dispute pertains to the fulfillment of the Genocide Convention's Article III prohibition on 'complicity with genocide.' Although the UAE acceded to the convention, its express reservation to the dispute resolution clause under Article IX may present a hurdle for the ICJ to assume jurisdiction.",
      "Pending final judgment, Sudan has requested provisional measures, including requiring the UAE to 'take all measures within its power' to prevent genocidal acts against Darfur's Masalit ethnic group.",
      "In response, UAE Foreign Minister Anwar Gargash stated on social media that Sudan should prioritize a ceasefire over a 'publicity tactic' to justify its rejection of peace."
    ],
    "domain_name": "countervortex.org"
  }
},
{
  "38": {
    "url": "https://nation.africa/kenya/news/africa/sudan-s-war-what-s-driving-uae-and-saudi-arabia-interests--4966818",
    "title": "Sudan’s war: What’s driving UAE and Saudi Arabia interests?",
    "description": "An analysis of the roles and motivations of the United Arab Emirates and Saudi Arabia in the Sudanese civil war, focusing on their historical ties, economic interests, and geopolitical strategies in the region.",
    "keywords": "Sudan, UAE, Saudi Arabia, civil war, Rapid Support Forces, economic interests, geopolitical strategy",
    "author": "Federico Donelli",
    "publication_date": "2025-03-16",
    "language": "en-US",
    "favicon_url": "https://nation.africa/favicon.ico",
    "og_title": "Sudan’s war: What’s driving UAE and Saudi Arabia interests?",
    "og_description": "An exploration of the involvement of the UAE and Saudi Arabia in Sudan's civil war, examining their economic and geopolitical interests, including historical ties, investments in agriculture and gold, and strategic positioning in the Red Sea region.",
    "og_image": "https://nation.africa/resource/image/4966818/portrait_ratio1x1/320/320/2f5e0c7d2d9c9e3c8c0d5c2c9e5f7e5e/ia/sudan-conflict.jpg",
    "og_url": "https://nation.africa/kenya/news/africa/sudan-s-war-what-s-driving-uae-and-saudi-arabia-interests--4966818",
    "og_type": "article",
    "headings": [
      "Sudan’s war: What’s driving UAE and Saudi Arabia interests?",
      "Federico Donelli",
      "March 16, 2025",
      "The civil war in Sudan that began in April 2023 involves several external actors. The conflict pits the Sudanese Armed Forces against the paramilitary Rapid Support Forces in a quest for political and economic power. The situation has created one of the world’s worst humanitarian crises. Various foreign states have picked a side to support. They include Chad, Egypt, Iran, Libya, Qatar, Russia, Saudi Arabia and the United Arab Emirates (UAE).",
      "In particular, Saudi Arabia and the UAE are providing financial and military support to the warring parties, although they have denied it. Political scientist Federico Donelli, who has studied the influence of these Gulf monarchies in Sudan, unpacks the implications of their intervention.",
      "How did the UAE and Saudi Arabia get involved in Sudan?",
      "Domestic factors within Sudan were the primary triggers for the outbreak of the civil war. Framing the Sudanese conflict as a proxy war may underestimate or overlook important internal variables.",
      "But it’s also important to highlight the indirect involvement of other states. In the Horn of Africa region, Sudan has interacted the most with Middle Eastern states over the past two decades. Among these states, two Gulf monarchies – Saudi Arabia and the UAE – stand out.",
      "Political relations between Saudi Arabia and Sudan date back to the independence of the Sudanese state in 1956. And people-to-people links have flourished over centuries. This is largely because Sudan is geographically close to Saudi and the two Muslim holy cities of Mecca (Makkah) and Medina.",
      "The case of the UAE is different. Since the beginning of the new millennium, the Emirates have expanded their economic and financial influence in Africa, investing in niche sectors such as port logistics. Sudan in particular came to the fore for the Emirates after the secession of South Sudan in 2011. The UAE invested in the agricultural sector, acquiring large tracts of land to ensure food security.",
      "The UAE also invested in the gold sector. Gold has been one of the main drivers of the Sudan conflict. It allows both parties to fuel their war machines. The UAE is the main beneficiary of this trade. It receives nearly all the gold smuggled from Sudan and has become a hub for laundering trafficked gold into the global market. The latest available statistics show that, officially, the UAE imported precious metals from Sudan valued at about US$2.3 billion in 2022.",
      "What are the interests of the two Gulf monarchies in Sudan?",
      "The UAE and Saudi Arabia have multiple interests in Sudan. These include:",
      "Economic interests: Both countries have invested heavily in Sudan’s agriculture and mining sectors. They see Sudan as a source of food security and a supplier of precious metals.",
      "Geopolitical interests: Sudan’s strategic location along the Red Sea makes it a key player in regional politics. The UAE and Saudi Arabia aim to counter the influence of rivals like Iran and Turkey in the region.",
      "Security interests: Both Gulf monarchies seek to ensure that Sudan does not become a haven for extremist groups that could threaten their own security.",
      "How have the UAE and Saudi Arabia influenced the Sudanese conflict?",
      "The involvement of the UAE and Saudi Arabia has had a significant impact on the dynamics of the Sudanese conflict. Their financial and military support has emboldened the warring parties, making them less willing to negotiate and prolonging the conflict.",
      "Moreover, their competition for influence in Sudan has further complicated the situation. While both countries support the Sudanese Armed Forces, they have also cultivated relationships with different factions within the military and political spheres, leading to a fragmented and unstable environment.",
      "What are the implications of their involvement for the future of Sudan?",
      "The involvement of the UAE and Saudi Arabia in Sudan’s conflict poses several challenges for the country’s future:",
      "Prolonged conflict: Their support for the warring parties may lead to a protracted conflict, resulting in more casualties and displacement.",
      "Undermined sovereignty: The heavy influence of foreign powers undermines Sudan’s sovereignty and hampers its ability to make independent decisions.",
      "Obstructed peace efforts: The competing interests of the UAE and Saudi Arabia may hinder coordinated international efforts to broker peace in Sudan.",
      "In conclusion, while domestic factors are the primary drivers of the Sudanese conflict, the involvement of external actors like the UAE and Saudi Arabia has exacerbated the situation. Their economic, geopolitical, and security interests have led them to support different factions, prolonging the conflict and complicating efforts to achieve peace."
    ],
    "domain_name": "nation.africa"
  }
},
{
  "39": {
    "url": "https://www.alestiklal.net/en/article/uae-backed-rsf-militia-s-genocide-against-the-masalit-tribe-in-darfur",
    "title": "UAE-Backed RSF Militia's Genocide Against the Masalit Tribe in Darfur",
    "description": "An in-depth report on the alleged genocide committed by the UAE-supported Rapid Support Forces (RSF) militia against the Masalit ethnic group in Darfur, Sudan, including details of atrocities and the ensuing legal actions.",
    "keywords": "Sudan, UAE, RSF, Masalit, Darfur, genocide, International Court of Justice, human rights violations",
    "author": "Al-Estiklal Newspaper",
    "publication_date": "2025-03-16",
    "language": "en-US",
    "favicon_url": "https://www.alestiklal.net/favicon.ico",
    "og_title": "UAE-Backed RSF Militia's Genocide Against the Masalit Tribe in Darfur",
    "og_description": "An investigation into the alleged genocide perpetrated by the UAE-backed RSF militia against the Masalit tribe in Darfur, highlighting the atrocities committed and Sudan's legal response.",
    "og_image": "https://www.alestiklal.net/uploads/images/2025/03/16/uae_rsf_masalit_genocide.jpg",
    "og_url": "https://www.alestiklal.net/en/article/uae-backed-rsf-militia-s-genocide-against-the-masalit-tribe-in-darfur",
    "og_type": "article",
    "headings": [
      "UAE-Backed RSF Militia's Genocide Against the Masalit Tribe in Darfur",
      "Al-Estiklal Newspaper",
      "March 16, 2025",
      "Massacres are not new in Sudan, where the ongoing civil war between the military and the Emirati-backed RSF militia has claimed the lives of thousands of civilians.",
      "However, a particularly tragic chapter is unfolding in Darfur, where the Masalit tribe faced a genocide in 2023.",
      "Harrowing testimonies and reports have emerged, accusing the RSF militia, with alleged Emirati backing, of killing, burning, and raping members of the tribe.",
      "This has led Sudan to file a request on March 6, 2025, to pursue legal action against the UAE at the International Court of Justice.",
      "Sudanese authorities accuse the UAE of fueling the war in their country by backing the RSF militia.",
      "Since April 2023, the Sudanese military and the RSF militia have been locked in a brutal conflict, leaving over 20,000 dead and nearly 15 million displaced, according to the United Nations and local authorities. However, a study by American universities estimates the death toll to be around 130,000.",
      "Genocide Allegations",
      "On March 6, the International Court of Justice announced that Sudan had filed a request to bring a case against the UAE regarding allegations of violations under the Convention on the Prevention and Punishment of the Crime of Genocide. The case specifically pertains to the mistreatment of the Masalit people in Sudan, particularly in the western region of Darfur.",
      "In its statement, the court added that Sudan's request concerns 'acts committed by' the Rapid Support Forces (RSF) and allied militias, including 'but not limited to, genocide, murder, theft of property, rape, forcible displacement, damage to property, and human rights violations.'",
      "According to the statement, 'all these acts were committed and facilitated through the direct support provided to the RSF militia and related militia groups by the United Arab Emirates.'",
      "Sudan’s request also pertains to 'actions adopted, approved, and carried out by the Government of the United Arab Emirates concerning the genocide against the Masalit group in the Republic of Sudan since at least 2023.'",
      "According to the statement, Sudan claims that the UAE is 'complicit in the genocide against the Masalit by directing and providing extensive financial, political, and military support to the Rapid Support Forces militia.'",
      "It also noted that the plaintiff (Sudan) seeks to establish the court’s jurisdiction under Article 36, paragraph 1, of the Court’s Statute and Article 9 of the Genocide Convention, to which both Sudan and the UAE are parties.",
      "Provisional Measures",
      "According to the statement, Sudan requests the court to consider the following interim measures pending a final judgment in the case:",
      "Firstly, 'In accordance with its obligations under the Convention on the Prevention and Punishment of the Crime of Genocide, with respect to the Masalit in the Republic of Sudan, the United Arab Emirates is required to take all measures within its power to prevent the commission of any acts falling under Article II of this Convention, specifically:",
      "(a) Killing members of the group.",
      "(b) Causing serious bodily or mental harm to members of the group.",
      "(c) Imposing living conditions intended to bring about its total or partial destruction.",
      "(d) Enforcing measures aimed at preventing reproduction within the group.'",
      "Secondly, 'The United Arab Emirates, with respect to members of the Masalit group, must ensure that no irregular armed units under its direction or support, nor any organizations or individuals subject to its control, direction, or influence, commit any acts described in point (1) above, or conspire to commit genocide, or directly and publicly incite genocide, or attempt to commit genocide.'"
    ],
    "domain_name": "alestiklal.net"
  }
},
{
  "40": {
    "url": "https://www.watanserb.com/en/2025/03/17/uaes-secret-washington-talks-tahnoun-bin-zayed-negotiates-high-stakes-deals-on-sudan-syria-and-gaza/",
    "title": "UAE's Secret Washington Talks: Tahnoun bin Zayed Negotiates High-Stakes Deals on Sudan, Syria, and Gaza",
    "description": "In covert meetings with U.S. officials, UAE National Security Advisor Tahnoun bin Zayed discusses strategic deals concerning Sudan, Syria, and Gaza, aiming to influence U.S. policy and expand UAE's regional influence.",
    "keywords": "UAE, Tahnoun bin Zayed, Washington talks, Sudan, Syria, Gaza, U.S. foreign policy, Middle East diplomacy",
    "author": "Basil Al Sayed",
    "publication_date": "2025-03-17",
    "language": "en-US",
    "favicon_url": "https://www.watanserb.com/favicon.ico",
    "og_title": "UAE's Secret Washington Talks: Tahnoun bin Zayed Negotiates High-Stakes Deals on Sudan, Syria, and Gaza",
    "og_description": "UAE National Security Advisor Tahnoun bin Zayed holds closed-door meetings with U.S. officials, discussing strategic deals that could shift power dynamics in the Middle East, focusing on Sudan, Syria, and Gaza.",
    "og_image": "https://www.watanserb.com/wp-content/uploads/2025/03/tahnoun_bin_zayed_washington_meetings.jpg",
    "og_url": "https://www.watanserb.com/en/2025/03/17/uaes-secret-washington-talks-tahnoun-bin-zayed-negotiates-high-stakes-deals-on-sudan-syria-and-gaza/",
    "og_type": "article",
    "headings": [
      "UAE's Secret Washington Talks: Tahnoun bin Zayed Negotiates High-Stakes Deals on Sudan, Syria, and Gaza",
      "Basil Al Sayed",
      "March 17, 2025",
      "In a covert intelligence move, UAE National Security Advisor Tahnoun bin Zayed traveled to Washington for closed-door meetings with the administration of U.S. President Donald Trump, according to leaks from Abu Dhabi.",
      "Speculation is growing over potential strategic deals involving Sudan, Syria, and Gaza, which could reshape the balance of power in the Middle East.",
      "Leaks from UAE decision-making circles suggest that Tahnoun aims to convince the Trump administration to:",
      "Shield Abu Dhabi from international sanctions or diplomatic pressure over its support for the Rapid Support Forces (RSF) militia.",
      "Influence the International Court of Justice (ICJ) to block investigations into war crimes committed by RSF.",
      "Ensure that the U.S. does not impose sanctions on the UAE for its involvement in Sudan.",
      "The Proposed Deal:",
      "Securing major military and security deals between the UAE and U.S. defense companies.",
      "Enhancing intelligence coordination between Abu Dhabi and Washington to whitewash the UAE’s role in Sudan.",
      "The Secret Mission:",
      "Concealing any evidence of the UAE arming RSF.",
      "Mobilizing American lobbying groups to freeze any legal action against the UAE.",
      "Syria: UAE Seeks to Replace Iranian Influence",
      "Tahnoun brings to Washington a strategic plan to reshape Syria by:",
      "Supporting UAE-backed factions to counter Iranian influence.",
      "Undermining the recent SDF-Damascus agreement to prevent stability that could benefit Iran.",
      "Coordinating covert operations inside Syria with Israel and Washington.",
      "The Proposed Deal:",
      "Securing U.S. support for UAE influence in Syria as an alternative to Iran.",
      "Ensuring continued Israeli airstrikes on Syria under diplomatic cover from Abu Dhabi.",
      "The Secret Mission:",
      "Funding sabotage operations inside Syria using mercenaries and operatives.",
      "Promoting separatism among minority groups with Israeli-backed guarantees.",
      "Providing diplomatic backing to Israel for ongoing airstrikes on Syrian territory."
    ],
    "domain_name": "watanserb.com"
  }
},
{
  "41": {
    "url": "https://www.politico.com/news/2025/03/07/arms-sales-uae-00217874",
    "title": "Lawmakers Move to Block Arms Sales to UAE Over Sudan Conflict",
    "description": "U.S. lawmakers are pushing to halt arms transfers to the United Arab Emirates following reports it has armed Sudan’s Rapid Support Forces (RSF), a militia accused of war crimes. Proposed legislation seeks to tighten export controls and sanction states fueling the conflict.",
    "keywords": "UAE, Sudan, RSF, arms sales, Gregory Meeks, U.S. Congress, sanctions, war crimes, Middle East, foreign policy",
    "author": "Nahal Toosi",
    "publication_date": "2025-03-07",
    "language": "en-US",
    "favicon_url": "https://static.politico.com/favicon.ico",
    "og_title": "Lawmakers Move to Block Arms Sales to UAE Over Sudan Conflict",
    "og_description": "In response to UAE support for Sudan’s RSF militia, U.S. lawmakers propose halting arms sales and increasing sanctions to deter further destabilisation.",
    "og_image": "https://static.politico.com/30/d6/fb0be5e347489cbd6bc97f6b7f96/arms-sales-uae.jpg",
    "og_url": "https://www.politico.com/news/2025/03/07/arms-sales-uae-00217874",
    "og_type": "article",
    "headings": [
      "Lawmakers Move to Block Arms Sales to UAE Over Sudan Conflict",
      "Nahal Toosi",
      "March 7, 2025",
      "U.S. lawmakers are growing increasingly concerned over reports that the UAE has supplied weapons and funding to the RSF militia in Sudan, a group accused of committing atrocities.",
      "Representative Gregory Meeks has held up arms sales to the UAE since late 2024 and plans to introduce new legislation titled the U.S. Engagement in Sudanese Peace Act.",
      "Proposed measures would include:",
      "Barring U.S. arms transfers to any country supporting combatants in Sudan.",
      "Expanding sanctions against armed groups and their supporters.",
      "Funding a special U.S. envoy to help broker peace in Sudan.",
      "Additional legislation is being drafted by Senator Chris Van Hollen and Representative Sara Jacobs, focusing specifically on the UAE’s role.",
      "The Sudan conflict has killed around 150,000 people and displaced millions, with the RSF accused of war crimes and genocide.",
      "Sudan submitted a formal complaint to the UN Security Council in late 2024, accusing the UAE of supplying arms and transporting RSF fighters for medical care in Abu Dhabi.",
      "Evidence included images of UAE-marked ammunition boxes and vehicles linked to RSF operations.",
      "The UAE denies wrongdoing, but U.S. lawmakers say further scrutiny is essential to uphold international law."
    ],
    "domain_name": "politico.com"
  }
}


]
}
  
  
  



  
  
  
  